      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
       01  TOWN-REC.
           03  TOWN-DAT-NUM           PIC X(06).
           03  TOWN-DAT-SPACE1        PIC X(01).
           03  TOWN-DAT-KOKINUM       PIC X(08).
           03  TOWN-DAT-SPACE2        PIC X(01).
           03  TOWN-DAT-NAME          PIC X(20).
           03  TOWN-DAT-KAIGYO        PIC X(01).
