--                       --
-- システム管理          --
-- 一部負担金給与控除一覧、入院会計一括作成追加
--                       --
-- 2006/03/23            --
--                       --

COPY "tbl_syskanri" FROM stdin;
0044	1021    	00000000	99999999	一部負担金給与控除一覧                                                                                                                                          ORCBG015                診療年月            YM                                                                                                                                                                                                                                                                                      1			20060323	20060323	140551
0044	1022    	00000000	99999999	入院会計一括作成                                                                                                                                                ORCBCRENYUACCT          処理年月            YM                                                                                                                                                                                                                                                                                      1			20060323	20060323	141058
\.
