      *******************************************************************
      * Project code name "ORCA"
      * ∆¸∞Â…∏Ω‡•Ï•ª•◊•»•Ω•’•»° JMA standard receipt software°À
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      ************************************************************
      *          ∞ÂŒ≈»Ò¿¡µ·ΩÒ COPY (CPRMF100.INC) *
      ************************************************************
      ************************************************************
      *  •≥•‘°º∂ÁΩ§¿µÕ˙ŒÚ
      * Maj/Min/Rev  Ω§¿µº‘       ∆¸…’      ∆‚Õ∆
      ************************************************************
      *01  MF100-REC.
           03  MF100-KEY.
      *∞Ï»Ã°¶œ∑øÕ∂Ë ¨
               05  MF100-KBN              PIC  X(1).
      *∏¯»Ò°›…È√¥º‘»÷πÊ
               05  MF100-FTNJANUM         PIC  X(08).
      *∑ÔøÙ
           03  MF100-KENSU                PIC  9(04).
      * °ª„∞ÂŒ≈»Ò≈¿øÙ(∂‚≥€)
           03  MF100-TENSU                PIC  9(08).
      *∑Î≥À¿∫ø¿≈¿øÙ
           03  MF100-KESETENSU            PIC  9(08).
      *ÃÙ∫ﬁ∞Ï…Ù…È√¥∂‚
           03  MF100-YKZFTN               PIC  9(08).
      *∑Î≥À¿∫ø¿ÃÙ∫ﬁ∞Ï…Ù…È√¥∂‚
           03  MF100-KESEYKZFTN           PIC  9(07).
      * °ª„∞ÂŒ≈»Òø©ªˆΩı¿Æ≥€
           03  MF100-JOSEIGK              PIC  9(07).
