--                                                  --
-- 入院基本データ（マスター登録内容の変更）         --
--                                                  --
-- 精神病棟特別入院基本料（期間加算の変更）         --
-- 精神病棟１０対１特別入院基本料（期間加算の変更） --
--                                                  --
-- Create Date : 2010/09/27                         --
--                                                  --
\set ON_ERROR_STOP

delete from tbl_nyuinkhn where khn_srycd = '190085010' and yukostymd = '20100401';
delete from tbl_nyuinkhn where khn_srycd = '190134610' and yukostymd = '20100401';

COPY "tbl_nyuinkhn" FROM stdin;
190085010	20100401	99999999	1	 	  	  	  	  	  	550	190085310	190085510	190118270	190118370	190118370	190118470	         			        	        	      
190134610	20100401	99999999	1	 	  	  	  	  	  	992	190085310	190085510	190118270	190118370	190118370	190118470	         			        	        	      
\.
