delete from tbl_syskanri where kanricd = '5111' and styukymd = '20061001';
delete from tbl_syskanri where kanricd = '5111' and kbncd    = '23';

COPY "tbl_syskanri" FROM stdin;
5111	37      	20061001	99999999	190123710療養病棟入院基本料２（入院基本料Ａ）（生活療養）            療養(Ａ）（生活療養）   051			        	        	      
5111	38      	20061001	99999999	190123810療養病棟入院基本料２（入院基本料Ｂ）（生活療養）            療養(Ｂ）（生活療養）   051			        	        	      
5111	39      	20061001	99999999	190123910療養病棟入院基本料２（入院基本料Ｃ）（生活療養）            療養(Ｃ）（生活療養）   051			        	        	      
5111	40      	20061001	99999999	190124010療養病棟入院基本料２（入院基本料Ｄ）（生活療養）            療養(Ｄ）（生活療養）   051			        	        	      
5111	41      	20061001	99999999	190124110療養病棟入院基本料２（入院基本料Ｅ）（生活療養）            療養(Ｅ）（生活療養）   051			        	        	      
5111	42      	20061001	99999999	190124210療養病棟入院基本料２（特別入院基本料）（生活療養）          療養(特別）（生活療養） 051			        	        	      
5111	43      	20061001	99999999	190124310有床診療所療養病床入院基本料２（入院基本料Ａ）（生活療養）  療養(Ａ）（生活療養）   061			        	        	      
5111	44      	20061001	99999999	190124410有床診療所療養病床入院基本料２（入院基本料Ｂ）（生活療養）  療養(Ｂ）（生活療養）   061			        	        	      
5111	45      	20061001	99999999	190124510有床診療所療養病床入院基本料２（入院基本料Ｃ）（生活療養）  療養(Ｃ）（生活療養）   061			        	        	      
5111	46      	20061001	99999999	190124610有床診療所療養病床入院基本料２（入院基本料Ｄ）（生活療養）  療養(Ｄ）（生活療養）   061			        	        	      
5111	47      	20061001	99999999	190124710有床診療所療養病床入院基本料２（入院基本料Ｅ）（生活療養）  療養(Ｅ）（生活療養）   061			        	        	      
5111	48      	20061001	99999999	190124810有床診療所療養病床入院基本料２（特別入院基本料）（生活療養）療養(特別）（生活療養） 061			        	        	      
5111	49      	20061001	99999999	190125010診療所老人医療管理料（生活療養）                            診老管（生活療養）      011			        	        	      
5111	50      	20061001	99999999	190125310短期滞在手術基本料２（生活療養）                            短期滞在２（生活療養）  021			        	        	      
5111	23      	00000000	99999999	190774210診療所老人医療管理料（３０日を経過しない再入院）            診老管（再入院）        04			        	        	      
5111	51      	20061001	99999999	190125210診療所老人医療管理料（３０日を経過しない再入院）（生活療養）診老管（再入院）（生活）041			        	        	      
\.
