      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ******************************************************************
      *    api21　（ＡＰＩ診療行為　一体）
      ******************************************************************
      *ORAPI021S1V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST03-//.
      *ORAPI021S2V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST04-//.
      *ORAPI021S3V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST05-//.
      *ORAPI021S4V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST06-//.
      *ORAPICLAIM21S1V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST07-//.
      *ORAPI021S5V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST08-//.
      *ORAPI021S6V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST09-//.
      *ORAPI021S2V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST10-//.
      *ORAPI021S7V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST11-//.
      *ORAPI021NS1V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST12-//.
      *ORAPI021NS2V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST13-//.
      *ORAPI021NS3V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST14-//.
      *ORAPI021NS4V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST15-//.
      *ORAPI021S3V2
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST16-//.
      *ORAPI021NS5V3
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST17-//.
