        02  C50ERR.
      ***** 02  C50ERR-FIXED1.
              03  C50ERR-ERRCODE.
                04  C50ERR-VALUE    PIC X(10).
              03  C50ERR-ERRMSG.
                04  C50ERR-VALUE    PIC X(80).
