      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *----------------------------------------------------------------*
      *    向精神薬成分コードテーブル COPY (CMPSYCHOTROPIC.INC)
      *----------------------------------------------------------------*
      *****************************************************************
      *  コピー句修正履歴
      * Maj/Min/Rev  修正者       日付      内容
      * 01.00.01     NACL-伊藤    14/10/22  通知により追加
      *****************************************************************
      *
       01  TBL-PSYCHO-CODE-AREA.
      *
      * 1:抗不安薬
      * 01
      *    オキサゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124013 00000000 99999999 1 1124013".
      *    クロキサゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124014 00000000 99999999 1 1124014".
      *    クロラゼプ酸二カリウム
           03  FILLER  PIC X(35)   VALUE
               "1124015 00000000 99999999 1 1124015".
      *    ジアゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124017 00000000 99999999 1 1124017".
           03  FILLER  PIC X(35)   VALUE
               "1124701 00000000 99999999 1 1124017".
      *    フルジアゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124019 00000000 99999999 1 1124019".
      *    ブロマゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124020 00000000 99999999 1 1124020".
           03  FILLER  PIC X(35)   VALUE
               "1124700 00000000 99999999 1 1124020".
      *    メダゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124021 00000000 99999999 1 1124021".
      *    ロラゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124022 00000000 99999999 1 1124022".
      * 11
      *    アルプラゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124023 00000000 99999999 1 1124023".
      *    フルタゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124024 00000000 99999999 1 1124024".
      *    メキサゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124025 00000000 99999999 1 1124025".
      *    トフィソパム
           03  FILLER  PIC X(35)   VALUE
               "1124026 00000000 99999999 1 1124026".
      *    フルトプラゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124027 00000000 99999999 1 1124027".
      *    クロルジアゼポキシド
           03  FILLER  PIC X(35)   VALUE
               "1124028 00000000 99999999 1 1124028".
      *    ロフラゼプ酸エチル
           03  FILLER  PIC X(35)   VALUE
               "1124029 00000000 99999999 1 1124029".
      *    タンドスピロンクエン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1129008 00000000 99999999 1 1129008".
      *    ヒドロキシジン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179005 00000000 99999999 1 1179005".
      *    クロチアゼパム
           03  FILLER  PIC X(35)   VALUE
               "1179012 00000000 99999999 1 1179012".
      * 21
      *    ヒドロキシジンパモ酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179019 00000000 99999999 1 1179019".
      *    エチゾラム
           03  FILLER  PIC X(35)   VALUE
               "1179025 00000000 99999999 1 1179025".
      *    ガンマオリザノール
           03  FILLER  PIC X(35)   VALUE
               "2900002 00000000 99999999 1 2900002".
      * 2:睡眠薬
      *    ブロモバレリル尿素
           03  FILLER  PIC X(35)   VALUE
               "1121001 00000000 99999999 2 1121001".
      *    抱水クロラール
           03  FILLER  PIC X(35)   VALUE
               "1123001 00000000 99999999 2 1123001".
           03  FILLER  PIC X(35)   VALUE
               "1123700 00000000 99999999 2 1123001".
      *    エスタゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124001 00000000 99999999 2 1124001".
      *    フルラゼパム塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1124002 00000000 99999999 2 1124002".
      *    ニトラゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124003 00000000 99999999 2 1124003".
      *    ニメタゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124004 00000000 99999999 2 1124004".
      * 31
      *    ハロキサゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124005 00000000 99999999 2 1124005".
      *    トリアゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124007 00000000 99999999 2 1124007".
      *    フルニトラゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124008 00000000 99999999 2 1124008".
      *    ブロチゾラム
           03  FILLER  PIC X(35)   VALUE
               "1124009 00000000 99999999 2 1124009".
      *    ロルメタゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124010 00000000 99999999 2 1124010".
      *    クアゼパム
           03  FILLER  PIC X(35)   VALUE
               "1124030 00000000 99999999 2 1124030".
      *    アモバルビタール
           03  FILLER  PIC X(35)   VALUE
               "1125001 00000000 99999999 2 1125001".
      *    バルビタール
           03  FILLER  PIC X(35)   VALUE
               "1125002 00000000 99999999 2 1125002".
      *    フェノバルビタール
           03  FILLER  PIC X(35)   VALUE
               "1125003 00000000 99999999 2 1125003".
           03  FILLER  PIC X(35)   VALUE
               "1125004 00000000 99999999 2 1125003".
      * 41
      *    フェノバルビタールナトリウム
           03  FILLER  PIC X(35)   VALUE
               "1125700 00000000 99999999 2 1125700".
      *    ペントバルビタールカルシウム
           03  FILLER  PIC X(35)   VALUE
               "1125006 00000000 99999999 2 1125006".
      *    トリクロホスナトリウム
           03  FILLER  PIC X(35)   VALUE
               "1129004 00000000 99999999 2 1129004".
      *    クロルプロマジン・プロメタジン・フェノバルビタール
           03  FILLER  PIC X(35)   VALUE
               "1179100 00000000 99999999 2 1179100".
           03  FILLER  PIC X(35)   VALUE
               "1179101 00000000 99999999 2 1179100".
      *    リルマザホン塩酸塩水和物
           03  FILLER  PIC X(35)   VALUE
               "1129006 00000000 99999999 2 1129006".
      *    ゾピクロン
           03  FILLER  PIC X(35)   VALUE
               "1129007 00000000 99999999 2 1129007".
      *    ゾルピデム酒石酸塩
           03  FILLER  PIC X(35)   VALUE
               "1129009 00000000 99999999 2 1129009".
      *    エスゾピクロン
           03  FILLER  PIC X(35)   VALUE
               "1129010 00000000 99999999 2 1129010".
      *    ラメルテオン
           03  FILLER  PIC X(35)   VALUE
               "1190016 00000000 99999999 2 1190016".
      * 3:抗うつ薬
      * 51
      *    クロミプラミン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1174002 00000000 99999999 3 1174002".
      *    ロフェプラミン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1174004 00000000 99999999 3 1174004".
      *    トリミプラミンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1174005 00000000 99999999 3 1174005".
      *    イミプラミン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1174006 00000000 99999999 3 1174006".
      *    アモキサピン
           03  FILLER  PIC X(35)   VALUE
               "1179001 00000000 99999999 3 1179001".
      *    アミトリプチリン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179002 00000000 99999999 3 1179002".
      *    ノルトリプチリン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179004 00000000 99999999 3 1179004".
      *    マプロチリン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179008 00000000 99999999 3 1179008".
      *    ペモリン
           03  FILLER  PIC X(35)   VALUE
               "1179023 00000000 99999999 3 1179023".
      *    ドスレピン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179027 00000000 99999999 3 1179027".
      * 61
      *    ミアンセリン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179033 00000000 99999999 3 1179033".
      *    セチプチリンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179034 00000000 99999999 3 1179034".
      *    トラゾドン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179037 00000000 99999999 3 1179037".
      *    フルボキサミンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179039 00000000 99999999 3 1179039".
      *    ミルナシプラン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179040 00000000 99999999 3 1179040".
      *    パロキセチン塩酸塩水和物
           03  FILLER  PIC X(35)   VALUE
               "1179041 00000000 99999999 3 1179041".
      *    塩酸セルトラリン
           03  FILLER  PIC X(35)   VALUE
               "1179046 00000000 99999999 3 1179046".
      *    ミルタザピン
           03  FILLER  PIC X(35)   VALUE
               "1179051 00000000 99999999 3 1179051".
      *    デュロキセチン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179052 00000000 99999999 3 1179052".
      *    エスシタロプラムシュウ酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179054 00000000 99999999 3 1179054".
      * 4:抗精神病薬
      * 71
      *    クロルプロマジン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1171001 00000000 99999999 4 1171001".
      *    クロルプロマジンフェノールフタリン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1171005 00000000 99999999 4 1171005".
      *    ペルフェナジンフェンジゾ酸塩
           03  FILLER  PIC X(35)   VALUE
               "1172004 00000000 99999999 4 1172004".
      *    ペルフェナジン
           03  FILLER  PIC X(35)   VALUE
               "1172006 00000000 99999999 4 1172006".
           03  FILLER  PIC X(35)   VALUE
               "1172007 00000000 99999999 4 1172006".
      *    ペルフェナジンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1172013 00000000 99999999 4 1172013".
      *    プロペリシアジン
           03  FILLER  PIC X(35)   VALUE
               "1172005 00000000 99999999 4 1172005".
      *    トリフロペラジンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1172008 00000000 99999999 4 1172008".
      *    フルフェナジンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1172009 00000000 99999999 4 1172009".
      *    プロクロルペラジンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1172010 00000000 99999999 4 1172010".
      *    レボメプロマジン
      *****03  FILLER  PIC X(35)   VALUE
      *****    "xxxxxxx 00000000 99999999 4 xxxxxxx".
      * 81
      *    レボメプロマジンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1172014 00000000 99999999 4 1172014".
      *    ピパンペロン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179006 00000000 99999999 4 1179006".
      *    オキシペルチン
           03  FILLER  PIC X(35)   VALUE
               "1179011 00000000 99999999 4 1179011".
      *    スピペロン
           03  FILLER  PIC X(35)   VALUE
               "1179015 00000000 99999999 4 1179015".
      *    スルピリド
           03  FILLER  PIC X(35)   VALUE
               "1179016 00000000 99999999 4 1179016".
           03  FILLER  PIC X(35)   VALUE
               "2329009 00000000 99999999 4 1179016".
      *    ハロペリドール
           03  FILLER  PIC X(35)   VALUE
               "1179020 00000000 99999999 4 1179020".
      *    ピモジド
           03  FILLER  PIC X(35)   VALUE
               "1179022 00000000 99999999 4 1179022".
      *    ゾテピン
           03  FILLER  PIC X(35)   VALUE
               "1179024 00000000 99999999 4 1179024".
      *    チミペロン
           03  FILLER  PIC X(35)   VALUE
               "1179026 00000000 99999999 4 1179026".
      * 91
      *    ブロムペリドール
           03  FILLER  PIC X(35)   VALUE
               "1179028 00000000 99999999 4 1179028".
      *    カルピプラミン塩酸塩水和物
           03  FILLER  PIC X(35)   VALUE
               "1179029 00000000 99999999 4 1179029".
      *    クロカプラミン塩酸塩水和物
           03  FILLER  PIC X(35)   VALUE
               "1179030 00000000 99999999 4 1179030".
      *    カルピプラミンマレイン酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179031 00000000 99999999 4 1179031".
      *    スルトプリド塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179032 00000000 99999999 4 1179032".
      *    モサプラミン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179035 00000000 99999999 4 1179035".
      *    ネモナプリド
           03  FILLER  PIC X(35)   VALUE
               "1179036 00000000 99999999 4 1179036".
      *    モペロン塩酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179010 00000000 99999999 4 1179010".
      *    レセルピン
           03  FILLER  PIC X(35)   VALUE
               "2143006 00000000 99999999 4 2143006".
      *    リスペリドン
           03  FILLER  PIC X(35)   VALUE
               "1179038 00000000 99999999 4 1179038".
      *101
      *    クエチアピンフマル酸塩
           03  FILLER  PIC X(35)   VALUE
               "1179042 00000000 99999999 4 1179042".
      *    ペロスピロン塩酸塩水和物
           03  FILLER  PIC X(35)   VALUE
               "1179043 00000000 99999999 4 1179043".
      *    オランザピン
           03  FILLER  PIC X(35)   VALUE
               "1179044 00000000 99999999 4 1179044".
      *    アリピプラゾール
           03  FILLER  PIC X(35)   VALUE
               "1179045 00000000 99999999 4 1179045".
      *    ブロナンセリン
           03  FILLER  PIC X(35)   VALUE
               "1179048 00000000 99999999 4 1179048".
      *    クロザピン
           03  FILLER  PIC X(35)   VALUE
               "1179049 00000000 99999999 4 1179049".
      *    パリペリドン
           03  FILLER  PIC X(35)   VALUE
               "1179053 00000000 99999999 4 1179053".
      *
       01  TBL-PSYCHO-CODE-AREA-R  REDEFINES   TBL-PSYCHO-CODE-AREA.
           03  TBL-PSYCHO-OCC      OCCURS  107 INDEXED   TBL-PSY.
               05  TBL-PSYCHO-CODE         PIC X(07).
               05  TBL-PSYCHO-YOBI1        PIC X(01).
               05  TBL-PSYCHO-STYMD        PIC X(08).
               05  TBL-PSYCHO-YOBI2        PIC X(01).
               05  TBL-PSYCHO-EDYMD        PIC X(08).
               05  TBL-PSYCHO-YOBI3        PIC X(01).
               05  TBL-PSYCHO-CLASS        PIC X(01).
               05  TBL-PSYCHO-YOBI4        PIC X(01).
               05  TBL-PSYCHO-GROUP        PIC X(07).
      *
