        01  DBCATALOG-REC.
            02  CPDBCTG-INFO-1  PIC X(128).
            02  CPDBCTG-INFO-2  PIC X(128).
            02  CPDBCTG-INFO-3  PIC X(128).
            02  CPDBCTG-INFO-4  PIC X(128).
            02  CPDBCTG-INFO-5  PIC X(128).
            02  CPDBCTG-INFO-6  PIC X(128).
            02  CPDBCTG-INFO-7  PIC X(128).
            02  CPDBCTG-INFO-8  PIC X(128).
            02  CPDBCTG-INFO-9  PIC X(128).
            02  CPDBCTG-INFO-10 PIC X(128).
