      *01  DPCMDC-REC.
           03  DPCMDC-YUKOSTYMD      PIC X(8).
           03  DPCMDC-YUKOEDYMD      PIC X(8).
           03  DPCMDC-MDC-CD         PIC X(2).
           03  DPCMDC-MDC-NAME       PIC X(60).
