      *01  DPCBUNRUI-REC.
           03  DPCBUNRUI-YUKOSTYMD      PIC X(8).
           03  DPCBUNRUI-YUKOEDYMD      PIC X(8).
           03  DPCBUNRUI-MDC-CD         PIC X(2).
           03  DPCBUNRUI-BUNRUI-CD      PIC X(4).
           03  DPCBUNRUI-BUNRUI-NAME    PIC X(100).
