      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
       01  ONPRTID-AREA.
           03  ONPRTID-ORCHC01     PIC X(20)   VALUE "ORCHC01".
           03  ONPRTID-ORCHCM19    PIC X(20)   VALUE "ORCHCM19".
           03  ONPRTID-ORCHC03     PIC X(20)   VALUE "ORCHC03".
           03  ONPRTID-ORCHC30     PIC X(20)   VALUE "ORCHC30".
           03  ONPRTID-ORCHC33     PIC X(20)   VALUE "ORCHC33".
           03  ONPRTID-ORCHC04     PIC X(20)   VALUE "ORCHC04".
           03  ONPRTID-ORCHC62     PIC X(20)   VALUE "ORCHC62".
           03  ONPRTID-ORCHCN01    PIC X(20)   VALUE "ORCHCN01".
           03  ONPRTID-ORCHCN02    PIC X(20)   VALUE "ORCHCN02".
           03  ONPRTID-ORCHCN03    PIC X(20)   VALUE "ORCHCN03".
           03  ONPRTID-ORCHCN33    PIC X(20)   VALUE "ORCHCN33".
           03  ONPRTID-ORCHC501    PIC X(20)   VALUE "ORCHC501".
           03  ONPRTID-ORCHC502    PIC X(20)   VALUE "ORCHC502".
           03  ONPRTID-ORCHC503    PIC X(20)   VALUE "ORCHC503".
           03  ONPRTID-ORCHCN04    PIC X(20)   VALUE "ORCHCN04".
           03  ONPRTID-ORCHCN30    PIC X(20)   VALUE "ORCHCN30".
           03  ONPRTID-ORCHCN62    PIC X(20)   VALUE "ORCHCN62".
