      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      ******************************************************************
      *    ＡＰＩレスポンス受付情報           COPY (CPORCSNCHUKSN.INC)
      ******************************************************************
        01  SNCHUKSN-AREA.
            03 SNCHUKSN-BASEYMD                PIC X(08).
            03 SNCHUKSN-KBNNUM                 PIC 9(03).
            03 SNCHUKSN-EDANUM                 PIC 9(02).
            03 SNCHUKSN-KSNCD                  PIC X(09).
