      ************************************************************
      *      COPY (CPRLF003.INC)        *
      *
      ************************************************************
      ************************************************************
      *  コピー句修正履歴
      * Maj/Min/Rev  修正者       日付      内容
      ************************************************************
      *01  LF03-REC.
      *
           03  LF03-KEY.
      *     
               05  LF03-HOSPNUM         PIC 9(2).
      *
               05  LF03-PTID            PIC 9(10).
      *
               05  LF03-SRYKA           PIC X(02).
      *
           03  LF03-UID-NEW             PIC X(36).
      *
           03  LF03-UID-OLD             PIC X(36).
      *
           03  LF03-HKNCOMBINUM-TBL     OCCURS  20.
      *
               05  LF03-HKNCOMBINUM     PIC 9(04).
      *
               05  LF03-UID             PIC X(36).
