      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *    CPRPKEY.INC （帳票API KEY一覧）
      ********************************************************************
       01  RPKEY-CONST-AREA.
           03  RPKEY-COMMON                PIC X(20)   VALUE
                                       "common".
      *
           03  RPKEY-CHUSHASEN-N           PIC X(20)   VALUE
                                       "chushasen_n".
           03  RPKEY-KARTE-NO1             PIC X(20)   VALUE
                                       "karte_no1".
           03  RPKEY-KARTE-NO1-N           PIC X(20)   VALUE
                                       "karte_no1_n".
           03  RPKEY-KARTE-NO3             PIC X(20)   VALUE
                                       "karte_no3".
           03  RPKEY-KARTE-NO3-N           PIC X(20)   VALUE
                                       "karte_no3_n".
           03  RPKEY-MEISAISHO             PIC X(20)   VALUE
                                       "meisaisho".
           03  RPKEY-MEISAISHO-N           PIC X(20)   VALUE
                                       "meisaisho_n".
           03  RPKEY-OKUSURI-JOHO          PIC X(20)   VALUE
                                       "okusuri_joho".
           03  RPKEY-OKUSURI-JOHO-N        PIC X(20)   VALUE
                                       "okusuri_joho_n".
           03  RPKEY-OKUSURI-TECHO         PIC X(20)   VALUE
                                       "okusuri_techo".
           03  RPKEY-OKUSURI-TECHO-N       PIC X(20)   VALUE
                                       "okusuri_techo_n".
           03  RPKEY-SEIKYUSHO             PIC X(20)   VALUE
                                       "seikyusho".
           03  RPKEY-SEIKYUSHO-N           PIC X(20)   VALUE
                                       "seikyusho_n".
           03  RPKEY-SHIHARAI-SHOMEISHO    PIC X(20)   VALUE
                                       "shiharai_shomeisho".
           03  RPKEY-SHIJISEN-N            PIC X(20)   VALUE
                                       "shijisen_n".
           03  RPKEY-SHOHOSEN              PIC X(20)   VALUE
                                       "shohosen".
           03  RPKEY-SHOHOSEN-N            PIC X(20)   VALUE
                                       "shohosen_n".
           03  RPKEY-TAIIN-SHOMEISHO       PIC X(20)   VALUE
                                       "taiin_shomeisho".
           03  RPKEY-YOYAKUHYO             PIC X(20)   VALUE
                                       "yoyakuhyo".
           03  RPKEY-YOYAKUKANJALIST       PIC X(20)   VALUE
                                       "yoyakukanjalist".
           03  RPKEY-YOYAKULIST            PIC X(20)   VALUE
                                       "yoyakulist".

