      *******************************************************************
      * Project code name "ORCA"
      * ∆¸∞Â…∏Ω‡•Ï•ª•◊•»•Ω•’•»° JMA standard receipt software°À
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      ************************************************************
      *   Œ≈Õ‹…¬≈Ô•≥°º•…            (CPRYOYOCD.INC)
      ************************************************************
      *  •≥•‘°º∂ÁΩ§¿µÕ˙ŒÚ
      * Maj/Min/Rev  Ω§¿µº‘       ∆¸…’      ∆‚Õ∆
      ************************************************************
      *
      *=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
      *   Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡•≥°º•…
      *=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
       01  CONST-RYOYOCD-AREA.
           03  CONST-RYOYOCD-G.
               05  CONST-RYOYOCD-VAL.
      *-1---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190121310".
                   07                  PIC X(09)   VALUE "190121410".
                   07                  PIC X(09)   VALUE "190121510".
                   07                  PIC X(09)   VALUE "190121610".
                   07                  PIC X(09)   VALUE "190121710".
                   07                  PIC X(09)   VALUE "190131610".
                   07                  PIC X(09)   VALUE "190131810".
                   07                  PIC X(09)   VALUE "190132010".
                   07                  PIC X(09)   VALUE "190132210".
      *-2---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190123710".
                   07                  PIC X(09)   VALUE "190123810".
                   07                  PIC X(09)   VALUE "190123910".
                   07                  PIC X(09)   VALUE "190124010".
                   07                  PIC X(09)   VALUE "190124110".
                   07                  PIC X(09)   VALUE "190131710".
                   07                  PIC X(09)   VALUE "190131910".
                   07                  PIC X(09)   VALUE "190132110".
                   07                  PIC X(09)   VALUE "190132310".
      *-3---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190132410".
                   07                  PIC X(09)   VALUE "190132610".
                   07                  PIC X(09)   VALUE "190132810".
                   07                  PIC X(09)   VALUE "190133010".
                   07                  PIC X(09)   VALUE "190133210".
                   07                  PIC X(09)   VALUE "190133410".
                   07                  PIC X(09)   VALUE "190133610".
                   07                  PIC X(09)   VALUE "190133810".
                   07                  PIC X(09)   VALUE "190134010".
      *-4---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190132510".
                   07                  PIC X(09)   VALUE "190132710".
                   07                  PIC X(09)   VALUE "190132910".
                   07                  PIC X(09)   VALUE "190133110".
                   07                  PIC X(09)   VALUE "190133310".
                   07                  PIC X(09)   VALUE "190133510".
                   07                  PIC X(09)   VALUE "190133710".
                   07                  PIC X(09)   VALUE "190133910".
                   07                  PIC X(09)   VALUE "190134110".
      *-5---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190121810".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *-6---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190124210".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *-7---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190122010".
                   07                  PIC X(09)   VALUE "190122110".
                   07                  PIC X(09)   VALUE "190122210".
                   07                  PIC X(09)   VALUE "190122310".
                   07                  PIC X(09)   VALUE "190122410".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *-8---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190124310".
                   07                  PIC X(09)   VALUE "190124410".
                   07                  PIC X(09)   VALUE "190124510".
                   07                  PIC X(09)   VALUE "190124610".
                   07                  PIC X(09)   VALUE "190124710".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *-9---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190122510".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *10---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190124810".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *11---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190700910".
                   07                  PIC X(09)   VALUE "190701110".
                   07                  PIC X(09)   VALUE "190701310".
                   07                  PIC X(09)   VALUE "190701510".
                   07                  PIC X(09)   VALUE "190701710".
                   07                  PIC X(09)   VALUE "190701910".
                   07                  PIC X(09)   VALUE "190702110".
                   07                  PIC X(09)   VALUE "190702310".
                   07                  PIC X(09)   VALUE "190702510".
      *12---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190701010".
                   07                  PIC X(09)   VALUE "190701210".
                   07                  PIC X(09)   VALUE "190701410".
                   07                  PIC X(09)   VALUE "190701610".
                   07                  PIC X(09)   VALUE "190701810".
                   07                  PIC X(09)   VALUE "190702010".
                   07                  PIC X(09)   VALUE "190702210".
                   07                  PIC X(09)   VALUE "190702410".
                   07                  PIC X(09)   VALUE "190702610".
      *13---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190702710".
                   07                  PIC X(09)   VALUE "190702910".
                   07                  PIC X(09)   VALUE "190703110".
                   07                  PIC X(09)   VALUE "190703310".
                   07                  PIC X(09)   VALUE "190703510".
                   07                  PIC X(09)   VALUE "190703710".
                   07                  PIC X(09)   VALUE "190703910".
                   07                  PIC X(09)   VALUE "190704110".
                   07                  PIC X(09)   VALUE "190704310".
      *14---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190702810".
                   07                  PIC X(09)   VALUE "190703010".
                   07                  PIC X(09)   VALUE "190703210".
                   07                  PIC X(09)   VALUE "190703410".
                   07                  PIC X(09)   VALUE "190703610".
                   07                  PIC X(09)   VALUE "190703810".
                   07                  PIC X(09)   VALUE "190704010".
                   07                  PIC X(09)   VALUE "190704210".
                   07                  PIC X(09)   VALUE "190704410".
      *15---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190157210".
                   07                  PIC X(09)   VALUE "190157610".
                   07                  PIC X(09)   VALUE "190158010".
                   07                  PIC X(09)   VALUE "190158410".
                   07                  PIC X(09)   VALUE "190158810".
                   07                  PIC X(09)   VALUE "190159210".
                   07                  PIC X(09)   VALUE "190159610".
                   07                  PIC X(09)   VALUE "190160010".
                   07                  PIC X(09)   VALUE "190160410".
      *16---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190157410".
                   07                  PIC X(09)   VALUE "190157810".
                   07                  PIC X(09)   VALUE "190158210".
                   07                  PIC X(09)   VALUE "190158610".
                   07                  PIC X(09)   VALUE "190159010".
                   07                  PIC X(09)   VALUE "190159410".
                   07                  PIC X(09)   VALUE "190159810".
                   07                  PIC X(09)   VALUE "190160210".
                   07                  PIC X(09)   VALUE "190160610".
      *17---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190157310".
                   07                  PIC X(09)   VALUE "190157710".
                   07                  PIC X(09)   VALUE "190158110".
                   07                  PIC X(09)   VALUE "190158510".
                   07                  PIC X(09)   VALUE "190158910".
                   07                  PIC X(09)   VALUE "190159310".
                   07                  PIC X(09)   VALUE "190159710".
                   07                  PIC X(09)   VALUE "190160110".
                   07                  PIC X(09)   VALUE "190160510".
      *18---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190157510".
                   07                  PIC X(09)   VALUE "190157910".
                   07                  PIC X(09)   VALUE "190158310".
                   07                  PIC X(09)   VALUE "190158710".
                   07                  PIC X(09)   VALUE "190159110".
                   07                  PIC X(09)   VALUE "190159510".
                   07                  PIC X(09)   VALUE "190159910".
                   07                  PIC X(09)   VALUE "190160310".
                   07                  PIC X(09)   VALUE "190160710".
      *19---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190711410".
                   07                  PIC X(09)   VALUE "190711610".
                   07                  PIC X(09)   VALUE "190711810".
                   07                  PIC X(09)   VALUE "190712010".
                   07                  PIC X(09)   VALUE "190712210".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *20---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190711510".
                   07                  PIC X(09)   VALUE "190711710".
                   07                  PIC X(09)   VALUE "190711910".
                   07                  PIC X(09)   VALUE "190712110".
                   07                  PIC X(09)   VALUE "190712310".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *21---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190155210".
                   07                  PIC X(09)   VALUE "190155610".
                   07                  PIC X(09)   VALUE "190156010".
                   07                  PIC X(09)   VALUE "190156410".
                   07                  PIC X(09)   VALUE "190156810".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *22---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190155410".
                   07                  PIC X(09)   VALUE "190155810".
                   07                  PIC X(09)   VALUE "190156210".
                   07                  PIC X(09)   VALUE "190156610".
                   07                  PIC X(09)   VALUE "190157010".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *23---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190155310".
                   07                  PIC X(09)   VALUE "190155710".
                   07                  PIC X(09)   VALUE "190156110".
                   07                  PIC X(09)   VALUE "190156510".
                   07                  PIC X(09)   VALUE "190156910".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *24---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190155510".
                   07                  PIC X(09)   VALUE "190155910".
                   07                  PIC X(09)   VALUE "190156310".
                   07                  PIC X(09)   VALUE "190156710".
                   07                  PIC X(09)   VALUE "190157110".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
                   07                  PIC X(09)   VALUE "000000000".
      *25---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190162210".
                   07                  PIC X(09)   VALUE "190162410".
                   07                  PIC X(09)   VALUE "190162610".
                   07                  PIC X(09)   VALUE "190162810".
                   07                  PIC X(09)   VALUE "190163010".
                   07                  PIC X(09)   VALUE "190163210".
                   07                  PIC X(09)   VALUE "190163410".
                   07                  PIC X(09)   VALUE "190163610".
                   07                  PIC X(09)   VALUE "190163810".
      *26---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190162310".
                   07                  PIC X(09)   VALUE "190162510".
                   07                  PIC X(09)   VALUE "190162710".
                   07                  PIC X(09)   VALUE "190162910".
                   07                  PIC X(09)   VALUE "190163110".
                   07                  PIC X(09)   VALUE "190163310".
                   07                  PIC X(09)   VALUE "190163510".
                   07                  PIC X(09)   VALUE "190163710".
                   07                  PIC X(09)   VALUE "190163910".
      *27---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190166110".
                   07                  PIC X(09)   VALUE "190166310".
                   07                  PIC X(09)   VALUE "190166510".
                   07                  PIC X(09)   VALUE "190166710".
                   07                  PIC X(09)   VALUE "190166910".
                   07                  PIC X(09)   VALUE "190167110".
                   07                  PIC X(09)   VALUE "190167310".
                   07                  PIC X(09)   VALUE "190167510".
                   07                  PIC X(09)   VALUE "190167710".
      *28---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190166210".
                   07                  PIC X(09)   VALUE "190166410".
                   07                  PIC X(09)   VALUE "190166610".
                   07                  PIC X(09)   VALUE "190166810".
                   07                  PIC X(09)   VALUE "190167010".
                   07                  PIC X(09)   VALUE "190167210".
                   07                  PIC X(09)   VALUE "190167410".
                   07                  PIC X(09)   VALUE "190167610".
                   07                  PIC X(09)   VALUE "190167810".
      *29---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190185510".
                   07                  PIC X(09)   VALUE "190185710".
                   07                  PIC X(09)   VALUE "190185910".
                   07                  PIC X(09)   VALUE "190186110".
                   07                  PIC X(09)   VALUE "190186310".
                   07                  PIC X(09)   VALUE "190186510".
                   07                  PIC X(09)   VALUE "190186710".
                   07                  PIC X(09)   VALUE "190186910".
                   07                  PIC X(09)   VALUE "190187110".
      *30---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190185610".
                   07                  PIC X(09)   VALUE "190185810".
                   07                  PIC X(09)   VALUE "190186010".
                   07                  PIC X(09)   VALUE "190186210".
                   07                  PIC X(09)   VALUE "190186410".
                   07                  PIC X(09)   VALUE "190186610".
                   07                  PIC X(09)   VALUE "190186810".
                   07                  PIC X(09)   VALUE "190187010".
                   07                  PIC X(09)   VALUE "190187210".
      *31---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190183710".
                   07                  PIC X(09)   VALUE "190183910".
                   07                  PIC X(09)   VALUE "190184110".
                   07                  PIC X(09)   VALUE "190184310".
                   07                  PIC X(09)   VALUE "190184510".
                   07                  PIC X(09)   VALUE "190184710".
                   07                  PIC X(09)   VALUE "190184910".
                   07                  PIC X(09)   VALUE "190185110".
                   07                  PIC X(09)   VALUE "190185310".
      *32---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190183810".
                   07                  PIC X(09)   VALUE "190184010".
                   07                  PIC X(09)   VALUE "190184210".
                   07                  PIC X(09)   VALUE "190184410".
                   07                  PIC X(09)   VALUE "190184610".
                   07                  PIC X(09)   VALUE "190184810".
                   07                  PIC X(09)   VALUE "190185010".
                   07                  PIC X(09)   VALUE "190185210".
                   07                  PIC X(09)   VALUE "190185410".
      *33---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190215110".
                   07                  PIC X(09)   VALUE "190215310".
                   07                  PIC X(09)   VALUE "190215510".
                   07                  PIC X(09)   VALUE "190215710".
                   07                  PIC X(09)   VALUE "190215910".
                   07                  PIC X(09)   VALUE "190216110".
                   07                  PIC X(09)   VALUE "190216310".
                   07                  PIC X(09)   VALUE "190216510".
                   07                  PIC X(09)   VALUE "190216710".
      *34---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190215210".
                   07                  PIC X(09)   VALUE "190215410".
                   07                  PIC X(09)   VALUE "190215610".
                   07                  PIC X(09)   VALUE "190215810".
                   07                  PIC X(09)   VALUE "190216010".
                   07                  PIC X(09)   VALUE "190216210".
                   07                  PIC X(09)   VALUE "190216410".
                   07                  PIC X(09)   VALUE "190216610".
                   07                  PIC X(09)   VALUE "190216810".
      *35---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190202510".
                   07                  PIC X(09)   VALUE "190202710".
                   07                  PIC X(09)   VALUE "190202910".
                   07                  PIC X(09)   VALUE "190203110".
                   07                  PIC X(09)   VALUE "190203310".
                   07                  PIC X(09)   VALUE "190203510".
                   07                  PIC X(09)   VALUE "190203710".
                   07                  PIC X(09)   VALUE "190203910".
                   07                  PIC X(09)   VALUE "190204110".
      *36---------------------------------------------------------------
                   07                  PIC X(09)   VALUE "190202610".
                   07                  PIC X(09)   VALUE "190202810".
                   07                  PIC X(09)   VALUE "190203010".
                   07                  PIC X(09)   VALUE "190203210".
                   07                  PIC X(09)   VALUE "190203410".
                   07                  PIC X(09)   VALUE "190203610".
                   07                  PIC X(09)   VALUE "190203810".
                   07                  PIC X(09)   VALUE "190204010".
                   07                  PIC X(09)   VALUE "190204210".
      *        °˙§œ∆√ Ã∆˛±°¥À‹Œ¡
               05  CONST-RYOYOCD-R REDEFINES   CONST-RYOYOCD-VAL.
      *                £±°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±
      *                £≤°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ¿∏≥ËŒ≈Õ‹°À
      *                £≥°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤
      *                £¥°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À
      *            °˙  £µ°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡
      *            °˙  £∂°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À
      *                £∑°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡
      *                £∏°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À
      *            °˙  £π°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡
      *            °˙£±£∞°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡∆√ Ã∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À
      *              £±£±°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ±…¥…∑–≤·¡º√÷°À
      *              £±£≤°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ¿∏≥ËŒ≈Õ‹°À° ±…¥…∑–≤·¡º√÷°À
      *              £±£≥°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ±…¥…∑–≤·¡º√÷°À
      *              £±£¥°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ±…¥…∑–≤·¡º√÷°À
      *              £±£µ°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±
      *              £±£∂°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ¿∏≥ËŒ≈Õ‹°À
      *              £±£∑°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ±…¥…∑–≤·¡º√÷°À
      *              £±£∏°ß∆√ƒÍ∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ¿∏≥ËŒ≈Õ‹°¶±…¥…∑–≤·¡º√÷°À
      *              £±£π°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡° ±…¥…∑–≤·¡º√÷°À
      *              £≤£∞°ßÕ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°¥À‹Œ¡° ¿∏≥ËŒ≈Õ‹°À° ±…¥…∑–≤·¡º√÷°À
      *              £≤£±°ßŒ≈Õ‹…¬æ≤∞ ≥∞°¶Õ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°
      *              £≤£≤°ßŒ≈Õ‹…¬æ≤∞ ≥∞°¶Õ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°° ¿∏≥ËŒ≈Õ‹°À
      *              £≤£≥°ßŒ≈Õ‹…¬æ≤∞ ≥∞°¶Õ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°° ±…¥…∑–≤·¡º√÷°À
      *              £≤£¥°ßŒ≈Õ‹…¬æ≤∞ ≥∞°¶Õ≠æ≤ø«Œ≈ΩÍŒ≈Õ‹…¬æ≤∆˛±°° ¿∏≥ËŒ≈Õ‹°¶±…¥…∑–≤·¡º√÷°À
      *              £≤£µ°ß∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±
      *              £≤£∂°ß∞Ï»Ã…¬≈Ô°¶Œ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£±° ±…¥…∑–≤·¡º√÷°À
      *              £≤£∑°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ÃÎ∂–ª˛¥÷ƒ∂≤·∏∫ªª°À
      *              £≤£∏°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ÃÎ∂–ª˛¥÷ƒ∂≤·∏∫ªª°À
      *              £≤£π°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ÃÎ∂–ª˛¥÷∆√ Ã∆˛±°¥À‹Œ¡°À
      *              £≥£∞°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ÃÎ∂–ª˛¥÷∆√ Ã∆˛±°¥À‹Œ¡°À
      *              £≥£±°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¥«∏Óø¶∞˜øÙ≈˘∑–≤·¡º√÷°À
      *              £≥£≤°ßŒ≈Õ‹…¬≈Ô∆˛±°¥À‹Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ¥«∏Óø¶∞˜øÙ≈˘∑–≤·¡º√÷°À
      *              £≥£≥°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ∑–≤·¡º√÷£±°À
      *              £≥£¥°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ∑–≤·¡º√÷£±°À
      *              £≥£µ°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ∑–≤·¡º√÷£≤°À
      *              £≥£∂°ßŒ≈Õ‹…¬≈Ô∆˛±°Œ¡£≤° ¿∏≥ËŒ≈Õ‹°À° ∑–≤·¡º√÷£≤°À
                   07  CONST-RYOYOCD-KHN-OCC   OCCURS       36.
                       09  CONST-RYOYOCD       PIC X(09)    OCCURS  9.
               05  CONST-RYOYOCD-KHN-MAX       PIC 9(05)    VALUE   36.
               05  CONST-RYOYOCD-CD-MAX        PIC 9(05)    VALUE   9.
      *
      *=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
      *    ∞Ï»Ã°¶¿∏≥ËŒ≈Õ‹√÷¥π»ΩƒÍÕ—
      *=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
       01  CONST-TOK-LIFECD-G.
           03  CONST-TOK-LIFECD-VAL.
               05  FILLER              PIC X(03)   VALUE   "213".
               05  FILLER              PIC X(03)   VALUE   "216".
      *
               05  FILLER              PIC X(03)   VALUE   "218".
               05  FILLER              PIC X(03)   VALUE   "219".
      *
               05  FILLER              PIC X(03)   VALUE   "220".
               05  FILLER              PIC X(03)   VALUE   "221".
      *
               05  FILLER              PIC X(03)   VALUE   "227".
               05  FILLER              PIC X(03)   VALUE   "228".
      *
               05  FILLER              PIC X(03)   VALUE   "229".
               05  FILLER              PIC X(03)   VALUE   "230".
      *
               05  FILLER              PIC X(03)   VALUE   "231".
               05  FILLER              PIC X(03)   VALUE   "232".
      *
               05  FILLER              PIC X(03)   VALUE   "302".
               05  FILLER              PIC X(03)   VALUE   "349".
      *
               05  FILLER              PIC X(03)   VALUE   "321".
               05  FILLER              PIC X(03)   VALUE   "350".
      *
               05  FILLER              PIC X(03)   VALUE   "325".
               05  FILLER              PIC X(03)   VALUE   "337".
      *
               05  FILLER              PIC X(03)   VALUE   "326".
               05  FILLER              PIC X(03)   VALUE   "338".
      *
               05  FILLER              PIC X(03)   VALUE   "327".
               05  FILLER              PIC X(03)   VALUE   "339".
      *
               05  FILLER              PIC X(03)   VALUE   "328".
               05  FILLER              PIC X(03)   VALUE   "340".
      *
               05  FILLER              PIC X(03)   VALUE   "329".
               05  FILLER              PIC X(03)   VALUE   "341".
      *
               05  FILLER              PIC X(03)   VALUE   "330".
               05  FILLER              PIC X(03)   VALUE   "342".
      *
               05  FILLER              PIC X(03)   VALUE   "331".
               05  FILLER              PIC X(03)   VALUE   "343".
      *
               05  FILLER              PIC X(03)   VALUE   "332".
               05  FILLER              PIC X(03)   VALUE   "344".
      *
               05  FILLER              PIC X(03)   VALUE   "333".
               05  FILLER              PIC X(03)   VALUE   "345".
      *
               05  FILLER              PIC X(03)   VALUE   "334".
               05  FILLER              PIC X(03)   VALUE   "346".
      *
               05  FILLER              PIC X(03)   VALUE   "335".
               05  FILLER              PIC X(03)   VALUE   "347".
      *
               05  FILLER              PIC X(03)   VALUE   "336".
               05  FILLER              PIC X(03)   VALUE   "348".
      *
               05  FILLER              PIC X(03)   VALUE   "323".
               05  FILLER              PIC X(03)   VALUE   "351".
      *
               05  FILLER              PIC X(03)   VALUE   "352".
               05  FILLER              PIC X(03)   VALUE   "353".
      *
               05  FILLER              PIC X(03)   VALUE   "363".
               05  FILLER              PIC X(03)   VALUE   "364".
      *
               05  FILLER              PIC X(03)   VALUE   "365".
               05  FILLER              PIC X(03)   VALUE   "366".
      *
               05  FILLER              PIC X(03)   VALUE   "367".
               05  FILLER              PIC X(03)   VALUE   "368".
      *
               05  FILLER              PIC X(03)   VALUE   "369".
               05  FILLER              PIC X(03)   VALUE   "370".
      *
               05  FILLER              PIC X(03)   VALUE   "371".
               05  FILLER              PIC X(03)   VALUE   "372".
      *
               05  FILLER              PIC X(03)   VALUE   "373".
               05  FILLER              PIC X(03)   VALUE   "374".
      *
               05  FILLER              PIC X(03)   VALUE   "375".
               05  FILLER              PIC X(03)   VALUE   "376".
      *
               05  FILLER              PIC X(03)   VALUE   "377".
               05  FILLER              PIC X(03)   VALUE   "378".
      *
               05  FILLER              PIC X(03)   VALUE   "379".
               05  FILLER              PIC X(03)   VALUE   "380".
      *
               05  FILLER              PIC X(03)   VALUE   "381".
               05  FILLER              PIC X(03)   VALUE   "382".
      *
               05  FILLER              PIC X(03)   VALUE   "383".
               05  FILLER              PIC X(03)   VALUE   "384".
      *
               05  FILLER              PIC X(03)   VALUE   "385".
               05  FILLER              PIC X(03)   VALUE   "386".
      *
               05  FILLER              PIC X(03)   VALUE   "387".
               05  FILLER              PIC X(03)   VALUE   "388".
      *
               05  FILLER              PIC X(03)   VALUE   "397".
               05  FILLER              PIC X(03)   VALUE   "398".
      *
               05  FILLER              PIC X(03)   VALUE   "399".
               05  FILLER              PIC X(03)   VALUE   "39A".
      *
               05  FILLER              PIC X(03)   VALUE   "39B".
               05  FILLER              PIC X(03)   VALUE   "39C".
      *
               05  FILLER              PIC X(03)   VALUE   "39D".
               05  FILLER              PIC X(03)   VALUE   "39E".
      *
               05  FILLER              PIC X(03)   VALUE   "39F".
               05  FILLER              PIC X(03)   VALUE   "39G".
      *
               05  FILLER              PIC X(03)   VALUE   "39H".
               05  FILLER              PIC X(03)   VALUE   "39I".
      *
               05  FILLER              PIC X(03)   VALUE   "39J".
               05  FILLER              PIC X(03)   VALUE   "39K".
      *
               05  FILLER              PIC X(03)   VALUE   "39L".
               05  FILLER              PIC X(03)   VALUE   "39M".
      *
               05  FILLER              PIC X(03)   VALUE   "39N".
               05  FILLER              PIC X(03)   VALUE   "39O".
      *
               05  FILLER              PIC X(03)   VALUE   "39P".
               05  FILLER              PIC X(03)   VALUE   "39Q".
      *
               05  FILLER              PIC X(03)   VALUE   "39R".
               05  FILLER              PIC X(03)   VALUE   "39S".
      *
               05  FILLER              PIC X(03)   VALUE   "39T".
               05  FILLER              PIC X(03)   VALUE   "39U".
      *
               05  FILLER              PIC X(03)   VALUE   "39V".
               05  FILLER              PIC X(03)   VALUE   "39W".
      *
               05  FILLER              PIC X(03)   VALUE   "39X".
               05  FILLER              PIC X(03)   VALUE   "39Y".
      *
               05  FILLER              PIC X(03)   VALUE   "39Z".
               05  FILLER              PIC X(03)   VALUE   "3A0".
      *
               05  FILLER              PIC X(03)   VALUE   "3A1".
               05  FILLER              PIC X(03)   VALUE   "3A2".
      *
               05  FILLER              PIC X(03)   VALUE   "3A3".
               05  FILLER              PIC X(03)   VALUE   "3A4".
      *
               05  FILLER              PIC X(03)   VALUE   "3A5".
               05  FILLER              PIC X(03)   VALUE   "3A6".
      *
               05  FILLER              PIC X(03)   VALUE   "3A7".
               05  FILLER              PIC X(03)   VALUE   "3A8".
      *
               05  FILLER              PIC X(03)   VALUE   "3A9".
               05  FILLER              PIC X(03)   VALUE   "3AA".
      *
               05  FILLER              PIC X(03)   VALUE   "3AB".
               05  FILLER              PIC X(03)   VALUE   "3AC".
      *
               05  FILLER              PIC X(03)   VALUE   "3AD".
               05  FILLER              PIC X(03)   VALUE   "3AE".
      *
               05  FILLER              PIC X(03)   VALUE   "3AF".
               05  FILLER              PIC X(03)   VALUE   "3AG".
      *
               05  FILLER              PIC X(03)   VALUE   "3AL".
               05  FILLER              PIC X(03)   VALUE   "3AM".
      *
               05  FILLER              PIC X(03)   VALUE   "3AN".
               05  FILLER              PIC X(03)   VALUE   "3AO".
      *
               05  FILLER              PIC X(03)   VALUE   "3AP".
               05  FILLER              PIC X(03)   VALUE   "3AQ".
      *
               05  FILLER              PIC X(03)   VALUE   "3AR".
               05  FILLER              PIC X(03)   VALUE   "3AS".
      *
               05  FILLER              PIC X(03)   VALUE   "3AW".
               05  FILLER              PIC X(03)   VALUE   "3AX".
      *
               05  FILLER              PIC X(03)   VALUE   "3AY".
               05  FILLER              PIC X(03)   VALUE   "3AZ".
      *
               05  FILLER              PIC X(03)   VALUE   "3B0".
               05  FILLER              PIC X(03)   VALUE   "3B1".
      *
               05  FILLER              PIC X(03)   VALUE   "3B2".
               05  FILLER              PIC X(03)   VALUE   "3B3".
      *
               05  FILLER              PIC X(03)   VALUE   "3B4".
               05  FILLER              PIC X(03)   VALUE   "3B5".
      *
               05  FILLER              PIC X(03)   VALUE   "3B6".
               05  FILLER              PIC X(03)   VALUE   "3B7".
      *
               05  FILLER              PIC X(03)   VALUE   "3B8".
               05  FILLER              PIC X(03)   VALUE   "3B9".
      *
               05  FILLER              PIC X(03)   VALUE   "3BA".
               05  FILLER              PIC X(03)   VALUE   "3BB".
      *
               05  FILLER              PIC X(03)   VALUE   "3BC".
               05  FILLER              PIC X(03)   VALUE   "3BD".
      *
               05  FILLER              PIC X(03)   VALUE   "3BE".
               05  FILLER              PIC X(03)   VALUE   "3BF".
      *
               05  FILLER              PIC X(03)   VALUE   "3BG".
               05  FILLER              PIC X(03)   VALUE   "3BH".
      *
               05  FILLER              PIC X(03)   VALUE   "3BI".
               05  FILLER              PIC X(03)   VALUE   "3BJ".
      *
               05  FILLER              PIC X(03)   VALUE   "241".
               05  FILLER              PIC X(03)   VALUE   "242".
      *
               05  FILLER              PIC X(03)   VALUE   "243".
               05  FILLER              PIC X(03)   VALUE   "244".
      *
               05  FILLER              PIC X(03)   VALUE   "245".
               05  FILLER              PIC X(03)   VALUE   "246".
      *
               05  FILLER              PIC X(03)   VALUE   "247".
               05  FILLER              PIC X(03)   VALUE   "248".
      *
               05  FILLER              PIC X(03)   VALUE   "255".
               05  FILLER              PIC X(03)   VALUE   "256".
      *
               05  FILLER              PIC X(03)   VALUE   "257".
               05  FILLER              PIC X(03)   VALUE   "258".
      *
               05  FILLER              PIC X(03)   VALUE   "259".
               05  FILLER              PIC X(03)   VALUE   "260".
      *
               05  FILLER              PIC X(03)   VALUE   "261".
               05  FILLER              PIC X(03)   VALUE   "262".
      *
               05  FILLER              PIC X(03)   VALUE   "263".
               05  FILLER              PIC X(03)   VALUE   "264".
      *
               05  FILLER              PIC X(03)   VALUE   "265".
               05  FILLER              PIC X(03)   VALUE   "266".
      *
               05  FILLER              PIC X(03)   VALUE   "267".
               05  FILLER              PIC X(03)   VALUE   "268".
      *
               05  FILLER              PIC X(03)   VALUE   "3BZ".
               05  FILLER              PIC X(03)   VALUE   "3C0".
      *
               05  FILLER              PIC X(03)   VALUE   "3C1".
               05  FILLER              PIC X(03)   VALUE   "3C2".
      *
               05  FILLER              PIC X(03)   VALUE   "3C3".
               05  FILLER              PIC X(03)   VALUE   "3C4".
      *
               05  FILLER              PIC X(03)   VALUE   "3C5".
               05  FILLER              PIC X(03)   VALUE   "3C6".
      *
               05  FILLER              PIC X(03)   VALUE   "3CF".
               05  FILLER              PIC X(03)   VALUE   "3CG".
      *
               05  FILLER              PIC X(03)   VALUE   "3CH".
               05  FILLER              PIC X(03)   VALUE   "3CI".
           03  CONST-TOK-LIFECD-R  REDEFINES   CONST-TOK-LIFECD-VAL.
               05  CONST-TOK-LIFECD-OCC    OCCURS   91.
                   07  CONST-TOK-LIFECD-IPN
                                           PIC X(03).
                   07  CONST-TOK-LIFECD-LIFE
                                           PIC X(03).
           03  CONST-TOK-LIFECD-MAX    PIC 9(05)   VALUE   91.
      *
       01  CONST-EXRYOYO-G.
           03  CONST-EXRYOYO-VAL.
               05  FILLER              PIC X(09)   VALUE "190204110".
               05  FILLER              PIC X(09)   VALUE "190204310".
               05  FILLER              PIC X(09)   VALUE "190204210".
               05  FILLER              PIC X(09)   VALUE "190204410".
           03  CONST-EXRYOYO-R         REDEFINES   CONST-EXRYOYO-VAL.
               05  CONST-EXRYOYO-OCC   OCCURS  2.
                   07  CONST-EXRYOYO-DEFINED       PIC X(09).
                   07  CONST-EXRYOYO-UNDEFINED     PIC X(09).
           03  CONST-EXRYOYO-MAX    PIC 9(05)      VALUE   2.
      *
