          01  HC21.
              03  HC21-TANJYOG       PIC  X(2)  OCCURS  3.
              03  HC21-NENREI    PIC  X(3).
              03  HC21-KANANAME    PIC  X(30).
              03  HC21-NAME    PIC  X(26).
              03  HC21-SYOBYOMEI     PIC  X(44)  OCCURS  5.
              03  HC21-KEIKA         PIC  X(54)  OCCURS  8.
              03  HC21-TEKIYO1       PIC  X(28)  OCCURS  9.
              03  HC21-SRYKBN        PIC  X(2)   OCCURS  30.
              03  HC21-TEKIYO2       PIC  X(52)  OCCURS  30.
              03  HC21-TOTALTEN    PIC  X(6).
              03  HC21-TOTALMONEY    PIC  X(10).
              03  HC21-SYOKEI    PIC  X(7).
              03  HC21-SAISINKAISU    PIC  X(3).
              03  HC21-SHIDOKAISU    PIC  X(3).
              03  HC21-KOUTEN        PIC  X(7)   OCCURS  35.
              03  HC21-KAISU         PIC  X(3)   OCCURS  35.
              03  HC21-KHNTEN        PIC  X(7)   OCCURS  19.
              03  HC21-RSIIRYOCD    PIC  X(30).
              03  HC21-HOSPNAME    PIC  X(30).
              03  HC21-SAIGAIKBN    PIC  X(8).
              03  HC21-TANJYOY    PIC  X(2).
              03  HC21-TANJYOM    PIC  X(2).
              03  HC21-TANJYOD    PIC  X(2).
              03  HC21-SYOSHIN1    PIC  X(2).
              03  HC21-SYOSHIN2    PIC  X(2).
              03  HC21-SYOSHIN3    PIC  X(2).
              03  HC21-KEIZOKUKANRI    PIC  X(16).
              03  HC21-KINGAKU         PIC  X(7)   OCCURS  6.
              03  HC21-TENKI    PIC  X(1).
              03  HC21-SINKEI    PIC  X(1).
              03  HC21-PTNUM    PIC  X(20).
              03  HC21-KOFUNUM    PIC  X(9).
              03  HC21-RYOSTYMD    PIC  X(6).
              03  HC21-RYOEDYMD    PIC  X(6).
              03  HC21-NISSU    PIC  X(3).
              03  HC21-GOKEI    PIC  X(7).
