          01  HC25.
              03  HC25-TDFKNCD       PIC  X(4).
              03  HC25-HOSPCD        PIC  X(20).
              03  HC25-PRTYM         PIC  X(16).
              03  HC25-YUBIN1        PIC  X(3).
              03  HC25-YUBIN2        PIC  X(4).
              03  HC25-ADRS          PIC  X(30).
              03  HC25-HOSPNAME      PIC  X(30).
              03  HC25-KAISETUNAME   PIC  X(30).
              03  HC25-KENSU         PIC  X(5)     OCCURS  6.
              03  HC25-GKENSU1       PIC  X(5).
              03  HC25-GKENSU2       PIC  X(5).
              03  HC25-TENSU         PIC  X(11)    OCCURS  6.
              03  HC25-GTENSU1       PIC  X(11).
              03  HC25-GTENSU2       PIC  X(11).
              03  HC25-HEIYOKENSU1   PIC  X(5).
              03  HC25-HEIYOKENSU2   PIC  X(5).
              03  HC25-SYOKENSU      PIC  X(5)     OCCURS  6.
              03  HC25-GSYOKENSU1    PIC  X(5).
              03  HC25-GSYOKENSU2    PIC  X(5).
              03  HC25-SYOKINGAK     PIC  X(13)    OCCURS  6.
              03  HC25-GSYOKINGAK1   PIC  X(13).
              03  HC25-GSYOKINGAK2   PIC  X(13).
              03  HC25-KOHNUM        PIC  X(2)     OCCURS  22.
              03  HC25-KOHKBN        PIC  X(20)    OCCURS  22.
              03  HC25-KOHKENSU      PIC  X(5)     OCCURS  22.
              03  HC25-KOHTENSU      PIC  X(11)    OCCURS  22.