        01  HC503.
            02  HC503-TITLE PIC X(30).
            02  HC503-MAYAKU    PIC X(2).
            02  HC503-PTNUM PIC X(20).
            02  HC503-KANANAME  PIC X(40).
            02  HC503-NAME  PIC X(40).
            02  HC503-BIRTH PIC X(22).
            02  HC503-SEX   PIC X(2).
            02  HC503-AGE   PIC X(8).
            02  HC503-BYOTO PIC X(20).
            02  HC503-ROOMNO    PIC X(6).
            02  HC503-SRYYMD    PIC X(22).
            02  HC503-SYSYMD    PIC X(10).
            02  HC503-TIME  PIC X(5).
            02  HC503-SRYKA PIC X(20).
            02  HC503-DRNAME    PIC X(30).
            02  HC503-NAIYO
                    PIC X(112)  OCCURS  35 TIMES.
            02  HC503-BIKOH
                    PIC X(110)  OCCURS  3 TIMES.
            02  HC503-OPID  PIC X(16).
