        01  HCM05V01.
            02  HCM05V01-SYSYMD PIC X(22).
            02  HCM05V01-PAGE   PIC X(3).
            02  HCM05V01-TEISYUTUNAME   PIC X(12).
            02  HCM05V01-RENNUM
                    PIC X(5)    OCCURS  22 TIMES.
            02  HCM05V01-PTNUM
                    PIC X(20)   OCCURS  22 TIMES.
            02  HCM05V01-NAME
                    PIC X(26)   OCCURS  22 TIMES.
            02  HCM05V01-SRYYM
                    PIC X(16)   OCCURS  22 TIMES.
            02  HCM05V01-HENYM
                    PIC X(16)   OCCURS  22 TIMES.
            02  HCM05V01-SEIYM
                    PIC X(16)   OCCURS  22 TIMES.
            02  HCM05V01-JNISSU
                    PIC X(8)    OCCURS  22 TIMES.
            02  HCM05V01-JNISSU1
                    PIC X(8)    OCCURS  22 TIMES.
            02  HCM05V01-JNISSU2
                    PIC X(8)    OCCURS  22 TIMES.
            02  HCM05V01-HKNTEN
                    PIC X(11)   OCCURS  22 TIMES.
            02  HCM05V01-MONEY1
                    PIC X(11)   OCCURS  22 TIMES.
            02  HCM05V01-MONEY2
                    PIC X(11)   OCCURS  22 TIMES.
            02  HCM05V01-GKENSU PIC X(5).
            02  HCM05V01-GJNISSU    PIC X(8).
            02  HCM05V01-GJNISSU1   PIC X(8).
            02  HCM05V01-GJNISSU2   PIC X(8).
            02  HCM05V01-GHKNTEN    PIC X(11).
            02  HCM05V01-GMONEY1    PIC X(11).
            02  HCM05V01-GMONEY2    PIC X(11).
            02  HCM05V01-SKYKBN
                    PIC X(10)   OCCURS  22 TIMES.
            02  HCM05V01-MSG
                    PIC X(4)    OCCURS  22 TIMES.
            02  HCM05V01-HSRYYM PIC X(16).
            02  HCM05V01-TAISYO
                    PIC X(2)    OCCURS  22 TIMES.
            02  HCM05V01-HKNJANUM
                    PIC X(8)    OCCURS  22 TIMES.
