        01  HCM26.
            02  HCM26-NAME  PIC X(50).
            02  HCM26-PTNUM PIC X(30).
            02  HCM26-SRYKBN
                    PIC X(2)    OCCURS  110 TIMES.
            02  HCM26-TEKIYO
                    PIC X(52)   OCCURS  110 TIMES.
            02  HCM26-KANANAME  PIC X(50).
            02  HCM26-RENNUM    PIC X(7).
            02  HCM26-PAGE  PIC X(5).
