        01  HCM29V04.
            02  HCM29V04-NAME   PIC X(50).
            02  HCM29V04-PTNUM  PIC X(30).
            02  HCM29V04-SRYKBN
                    PIC X(2)    OCCURS  110 TIMES.
            02  HCM29V04-TEKIYO
                    PIC X(52)   OCCURS  110 TIMES.
            02  HCM29V04-KANANAME   PIC X(50).
            02  HCM29V04-RENNUM PIC X(7).
            02  HCM29V04-PAGE   PIC X(5).
            02  HCM29V04-LABEL  PIC X(14).
            02  HCM29V04-LOPTION    PIC X(100).
