        01  HCM331N.
            02  HCM331N-A-TBL           OCCURS  40 TIMES.
              03  HCM331N-NUM PIC X(2).
              03  HCM331N-SRYMD   PIC X(5).
              03  HCM331N-NAIYO
                      PIC X(8)    OCCURS  11 TIMES.
