        01  HCM401V01.
            02  HCM401V01-SRYYM PIC X(16).
            02  HCM401V01-NYUGAIKBN PIC X(8).
            02  HCM401V01-SAKYMD    PIC X(36).
            02  HCM401V01-PAGE  PIC X(6).
            02  HCM401V01-RENBAN
                    PIC X(10)   OCCURS  20 TIMES.
            02  HCM401V01-PTNUM
                    PIC X(20)   OCCURS  20 TIMES.
            02  HCM401V01-PTNUM2
                    PIC X(40)   OCCURS  20 TIMES.
            02  HCM401V01-NAME
                    PIC X(30)   OCCURS  20 TIMES.
            02  HCM401V01-NAME2
                    PIC X(60)   OCCURS  20 TIMES.
            02  HCM401V01-NENREI
                    PIC X(6)    OCCURS  20 TIMES.
            02  HCM401V01-MESG
                    PIC X(110)  OCCURS  20 TIMES.
            02  HCM401V01-MESG2
                    PIC X(220)  OCCURS  20 TIMES.
