        01  HCM49.
            02  HCM49-NAME  PIC X(50).
            02  HCM49-PTNUM PIC X(30).
            02  HCM49-SRYKBN
                    PIC X(2)    OCCURS  110 TIMES.
            02  HCM49-TEKIYO
                    PIC X(52)   OCCURS  110 TIMES.
            02  HCM49-KANANAME  PIC X(50).
            02  HCM49-RENNUM    PIC X(7).
            02  HCM49-PAGE  PIC X(5).
