        01  HCM59V01.
            02  HCM59V01-NAME   PIC X(50).
            02  HCM59V01-PTNUM  PIC X(20).
            02  HCM59V01-SRYKBN
                    PIC X(2)    OCCURS  110 TIMES.
            02  HCM59V01-TEKIYO
                    PIC X(52)   OCCURS  110 TIMES.
            02  HCM59V01-KANANAME   PIC X(50).
            02  HCM59V01-RENNUM PIC X(7).
            02  HCM59V01-PAGE   PIC X(5).
            02  HCM59V01-LABEL  PIC X(14).
