        01  HCM51V03.
            02  HCM51V03-HEAD.
              03  HCM51V03-NYUGAI PIC X(8).
              03  HCM51V03-HSRYYMD    PIC X(64).
              03  HCM51V03-HSRYKA PIC X(10).
              03  HCM51V03-SAKYMD PIC X(22).
              03  HCM51V03-PAGE   PIC X(5).
              03  HCM51V03-SRYYMDMSG  PIC X(10).
              03  HCM51V03-SYOSAIMSG  PIC X(10).
            02  HCM51V03-TBL            OCCURS  50 TIMES.
              03  HCM51V03-NO PIC X(3).
              03  HCM51V03-DENPNUM    PIC X(7).
              03  HCM51V03-PTNUM  PIC X(10).
              03  HCM51V03-PTNUM2 PIC X(20).
              03  HCM51V03-NAME   PIC X(20).
              03  HCM51V03-SRYYMD PIC X(9).
              03  HCM51V03-SYOSAI PIC X(4).
              03  HCM51V03-SRYKA  PIC X(2).
              03  HCM51V03-HOKEN  PIC X(10).
              03  HCM51V03-HKNTEN PIC X(12).
              03  HCM51V03-SKYMONEY   PIC X(12).
              03  HCM51V03-SKYHOKEN   PIC X(12).
              03  HCM51V03-SKYJIHI    PIC X(12).
              03  HCM51V03-GENMEN PIC X(12).
              03  HCM51V03-NYUKIN PIC X(12).
              03  HCM51V03-HOHO   PIC X(10).
              03  HCM51V03-HENKIN PIC X(12).
              03  HCM51V03-CHOSEI1    PIC X(12).
              03  HCM51V03-CHOSEI2    PIC X(12).
              03  HCM51V03-MISYU  PIC X(12).
              03  HCM51V03-ZENMISYU   PIC X(12).
            02  HCM51V03-TOTAL.
              03  HCM51V03-TTL-SYOSINMSG  PIC X(4).
              03  HCM51V03-TTL-SYOSIN PIC X(12).
              03  HCM51V03-TTL-SAISINMSG  PIC X(4).
              03  HCM51V03-TTL-SAISIN PIC X(12).
              03  HCM51V03-TTL-HKNTENMSG  PIC X(10).
              03  HCM51V03-TTL-HKNTEN PIC X(12).
              03  HCM51V03-TTL-SKYMONEYMSG    PIC X(10).
              03  HCM51V03-TTL-SKYMONEY   PIC X(12).
              03  HCM51V03-TTL-SKYHOKENMSG    PIC X(12).
              03  HCM51V03-TTL-SKYHOKEN   PIC X(12).
              03  HCM51V03-TTL-SKYJIHIMSG PIC X(10).
              03  HCM51V03-TTL-SKYJIHI    PIC X(12).
              03  HCM51V03-TTL-NYUKINMSG  PIC X(10).
              03  HCM51V03-TTL-NYUKIN PIC X(12).
              03  HCM51V03-TTL-CHOSEI1MSG PIC X(10).
              03  HCM51V03-TTL-CHOSEI1    PIC X(12).
              03  HCM51V03-TTL-CHOSEI2MSG PIC X(10).
              03  HCM51V03-TTL-CHOSEI2    PIC X(12).
              03  HCM51V03-TTL-GENMENMSG  PIC X(10).
              03  HCM51V03-TTL-GENMEN PIC X(12).
              03  HCM51V03-TTL-MISYUMSG   PIC X(10).
              03  HCM51V03-TTL-MISYU  PIC X(12).
              03  HCM51V03-TTL-KONNYUKINMSG   PIC X(16).
              03  HCM51V03-TTL-KONNYUKIN  PIC X(12).
              03  HCM51V03-TTL-TTLMSG PIC X(10).
            02  HCM51V03-LOPTION    PIC X(50).
