        01  HCM57.
            02  HCM57-NAME  PIC X(50).
            02  HCM57-PTNUM PIC X(30).
            02  HCM57-SRYKBN
                    PIC X(2)    OCCURS  110 TIMES.
            02  HCM57-TEKIYO
                    PIC X(52)   OCCURS  110 TIMES.
            02  HCM57-KANANAME  PIC X(50).
            02  HCM57-RENNUM    PIC X(7).
            02  HCM57-PAGE  PIC X(5).
