        01  HCM60.
            02  HCM60-KIGO  PIC X(20).
            02  HCM60-PRTYM PIC X(16).
            02  HCM60-HOSPSBT
                    PIC X(2)    OCCURS  2 TIMES.
            02  HCM60-KENSU
                    PIC X(6)    OCCURS  2 TIMES.
            02  HCM60-KINGAK
                    PIC X(13)   OCCURS  2 TIMES.
            02  HCM60-SEIYMD    PIC X(22).
            02  HCM60-HOSPCD    PIC X(7).
            02  HCM60-ADRS  PIC X(100).
            02  HCM60-HOSPNAME  PIC X(100).
            02  HCM60-KAISETUNAME   PIC X(60).
            02  HCM60-TEL   PIC X(15).
            02  HCM60-ATENA PIC X(30).
