        01  HCM65.
            02  HCM65-KIGO  PIC X(20).
            02  HCM65-PRTYM PIC X(16).
            02  HCM65-HOSPSBT
                    PIC X(2)    OCCURS  2 TIMES.
            02  HCM65-KENSU
                    PIC X(6)    OCCURS  3 TIMES.
            02  HCM65-KINGAK
                    PIC X(13)   OCCURS  3 TIMES.
            02  HCM65-SEIYMD    PIC X(22).
            02  HCM65-HOSPCD    PIC X(7).
            02  HCM65-ADRS  PIC X(100).
            02  HCM65-HOSPNAME  PIC X(100).
            02  HCM65-KAISETUNAME   PIC X(60).
