        01  HCML07.
            02  HCML07-PAGE PIC X(6).
            02  HCML07-MSTYMD   PIC X(22).
            02  HCML07-HOSPNAME PIC X(60).
            02  HCML07-SRYCD    PIC X(9)        OCCURS  15 TIMES.
            02  HCML07-NAME PIC X(100)  OCCURS  15 TIMES.
            02  HCML07-TEN  PIC X(14)   OCCURS  15 TIMES.
            02  HCML07-HKNTEK   PIC X(12)       OCCURS  15 TIMES.
            02  HCML07-BUI  PIC X(10)   OCCURS  15 TIMES.
            02  HCML07-GAITEN   PIC X(3)        OCCURS  15 TIMES.
            02  HCML07-NYUTEN   PIC X(3)        OCCURS  15 TIMES.
            02  HCML07-KRM1 PIC X(3)    OCCURS  15 TIMES.
            02  HCML07-KET1 PIC X(3)    OCCURS  15 TIMES.
            02  HCML07-KRM2 PIC X(3)    OCCURS  15 TIMES.
            02  HCML07-KET2 PIC X(3)    OCCURS  15 TIMES.
            02  HCML07-KRM3 PIC X(3)    OCCURS  15 TIMES.
            02  HCML07-KET3 PIC X(3)    OCCURS  15 TIMES.
            02  HCML07-KRM4 PIC X(3)    OCCURS  15 TIMES.
            02  HCML07-KET4 PIC X(3)    OCCURS  15 TIMES.
            02  HCML07-YUKOSTYMD    PIC X(8)    OCCURS  15 TIMES.
            02  HCML07-NYORO    PIC X(1)        OCCURS  15 TIMES.
            02  HCML07-YUKOEDYMD    PIC X(8)    OCCURS  15 TIMES.
