        02  K03.
     *******02  K03-FIXED3.
              03  K03-PTNUM.
                04  K03-VALUE   PIC X(20).
              03  K03-SRYYMD.
                04  K03-VALUE   PIC X(14).
              03  K03-KANANAME.
                04  K03-VALUE   PIC X(50).
              03  K03-NAME.
                04  K03-VALUE   PIC X(50).
              03  K03-SEX.
                04  K03-VALUE   PIC X(2).
              03  K03-BIRTHDAY.
                04  K03-VALUE   PIC X(9).
              03  K03-FTNRATE.
                04  K03-VALUE   PIC X(5).
              03  K03-HAKYMD-G.
                04  K03-HAKYMD-STATE   PIC S9(9)   BINARY.
                04  K03-HAKYMD  PIC X(10).
              03  K03-DENPNUM.
                04  K03-VALUE   PIC X(10).
              03  K03-SSUHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-SJTHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-SYCHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-CSYHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-TYKHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-ZTKHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-SDOHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-KNSHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-MSIHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-SSNHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-HOUHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-BYRHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-NYUHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-RYOHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-FTNTOTAL.
                04  K03-VALUE   PIC X(10).
              03  K03-TOTALHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-KOHFTN.
                04  K03-VALUE   PIC X(10).
              03  K03-ETCHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-GZUHKNTEN.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI1.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHIGOK.
                04  K03-VALUE   PIC X(10).
              03  K03-YKZFTN.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI5.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI4.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI3.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI2.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI6.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI7.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI8.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI9.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHI10.
                04  K03-VALUE   PIC X(10).
              03  K03-RJNFTN.
                04  K03-VALUE   PIC X(10).
              03  K03-CHOSEI-G.
                04  K03-CHOSEI-STATE   PIC S9(9)   BINARY.
                04  K03-CHOSEI   PIC X(10).
              03  K03-CHOSEI2-G.
                04  K03-CHOSEI2-STATE   PIC S9(9)   BINARY.
                04  K03-CHOSEI2   PIC X(10).
              03  K03-GOKSKY.
                04  K03-VALUE   PIC X(10).
              03  K03-MISYUZAN-G.
                04  K03-MISYUZAN-STYLE   PIC X(20).
                04  K03-MISYUZAN   PIC X(10).
              03  K03-SKYMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX.
                04  K03-VALUE   PIC X(10).
              03  K03-HKNTEKGAI.
                04  K03-VALUE   PIC X(10).
              03  K03-HKNTEKMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-NENREI.
                04  K03-VALUE   PIC X(6).
              03  K03-SUUTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-SDOTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-ZTKTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-TYKTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-CSYTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-SYCTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-SJTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-KNSTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-GZUTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-ETCTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-MSITGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-SSNTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-HOUTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-BYRTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-NYUTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-RYOTGMONEY.
                04  K03-VALUE   PIC X(10).
              03  K03-SYORIMEI.
                04  K03-SYORIMEI-STYLE   PIC X(20).
                04  K03-SYORIMEI-VALUE   PIC X(20).
              03  K03-ROUSYOSIN.
                04  K03-VALUE   PIC X(10).
              03  K03-ROUSAISIN.
                04  K03-VALUE   PIC X(10).
              03  K03-ROUSIDOU.
                04  K03-VALUE   PIC X(10).
              03  K03-ROUETC.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHIMSG2.
                04  K03-VALUE   PIC X(8).
              03  K03-JIHIMSG3.
                04  K03-VALUE   PIC X(8).
              03  K03-JIHITAXGOK.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX1.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX2.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX3.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX4.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX5.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX6.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX7.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX8.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX9.
                04  K03-VALUE   PIC X(10).
              03  K03-JIHITAX10.
                04  K03-VALUE   PIC X(10).
              03  K03-NYUKIN-G.
                04  K03-NYUKIN-STATE   PIC S9(9)   BINARY.
                04  K03-NYUKIN   PIC X(10).
              03  K03-JIHIMSG4.
                04  K03-VALUE   PIC X(8).
              03  K03-JIHIMSG5.
                04  K03-VALUE   PIC X(8).
              03  K03-JIHIMSG6.
                04  K03-VALUE   PIC X(8).
              03  K03-JIHIMSG7.
                04  K03-VALUE   PIC X(8).
              03  K03-JIHIMSG8.
                04  K03-VALUE   PIC X(8).
              03  K03-JIHIMSG9.
                04  K03-VALUE   PIC X(8).
              03  K03-JIHIMSG10.
                04  K03-VALUE   PIC X(8).
              03  K03-CHOUKAKIN-G.
                04  K03-CHOUKAKIN-STYLE   PIC X(20).
                04  K03-CHOUKAKIN   PIC X(10).
              03  K03-HKNCOMBI-COMB.
                04  K03-HKNCOMBI.
                  05  K03-VALUE   PIC X(65).
                04  K03-HKNCOMBI-COUNT   PIC S9(9)   BINARY.
                04  K03-HKNCOMBI-ITEM
                        PIC X(65)   OCCURS  15 TIMES.
              03  K03-SRYKA-COMB.
                04  K03-SRYKA.
                  05  K03-VALUE   PIC X(20).
                04  K03-SRYKA-COUNT   PIC S9(9)   BINARY.
                04  K03-SRYKA-ITEM
                        PIC X(20)   OCCURS  40 TIMES.
              03  K03-DRCDCOMBO.
                04  K03-DRCD.
                  05  K03-VALUE   PIC X(29).
                04  K03-DRCD-COUNT   PIC S9(9)   BINARY.
                04  K03-DRCD-ITEM
                        PIC X(29)   OCCURS  99 TIMES.
              03  K03-NYUKINHOU-COMB.
                04  K03-NYUKINHOU.
                  05  K03-VALUE   PIC X(30).
                04  K03-NYUKINHOU-COUNT   PIC S9(9)   BINARY.
                04  K03-NYUKINHOU-ITEM
                        PIC X(30)   OCCURS  99 TIMES.
              03  K03-NYUKINKBN-COMB.
                04  K03-NYUKINKBN.
                  05  K03-VALUE   PIC X(40).
                04  K03-NYUKINKBN-COUNT   PIC S9(9)   BINARY.
                04  K03-NYUKINKBN-ITEM
                        PIC X(40)   OCCURS  10 TIMES.
              03  K03-YAKJYOFLGCOMBO.
                04  K03-YAKJYOFLG.
                  05  K03-VALUE   PIC X(18).
                04  K03-YAKJYOFLG-COUNT   PIC S9(9)   BINARY.
                04  K03-YAKJYOFLG-ITEM
                        PIC X(18)   OCCURS  4 TIMES.
              03  K03-SYOHOPRTFLGCOMBO.
                04  K03-SYOHOPRTFLG.
                  05  K03-VALUE   PIC X(18).
                04  K03-SYOHOPRTFLG-COUNT   PIC S9(9)   BINARY.
                04  K03-SYOHOPRTFLG-ITEM
                        PIC X(18)   OCCURS  3 TIMES.
              03  K03-HAKFLGCOMBO.
                04  K03-HAKFLG.
                  05  K03-VALUE   PIC X(24).
                04  K03-HAKFLG-COUNT   PIC S9(9)   BINARY.
                04  K03-HAKFLG-ITEM
                        PIC X(24)   OCCURS  3 TIMES.
              03  K03-HAKHOUFLGCOMB.
                04  K03-HAKHOUFLG.
                  05  K03-VALUE   PIC X(30).
                04  K03-HAKHOUFLG-COUNT   PIC S9(9)   BINARY.
                04  K03-HAKHOUFLG-ITEM
                        PIC X(30)   OCCURS  5 TIMES.
              03  K03-JIHIMSG1.
                04  K03-VALUE   PIC X(8).
              03  K03-FUKUZENMDS2.
                04  K03-VALUE   PIC X(50).
              03  K03-FUKUZENMDS.
                04  K03-VALUE   PIC X(30).
              03  K03-FUKUMSG.
                04  K03-FUKUMSG-STYLE   PIC X(20).
                04  K03-FUKUMSG-VALUE   PIC X(50).
              03  K03-NYUKINMSG.
                04  K03-NYUKINMSG-STYLE   PIC X(20).
                04  K03-NYUKINMSG-VALUE   PIC X(50).
              03  K03-NYUMISYU.
                04  K03-NYUMISYU-STYLE   PIC X(20).
                04  K03-NYUMISYU-VALUE   PIC X(40).
              03  K03-USERPG-COMB.
                04  K03-USERPG-STATE   PIC S9(9)   BINARY.
                04  K03-USERPG.
                  05  K03-VALUE   PIC X(20).
                04  K03-USERPG-COUNT   PIC S9(9)   BINARY.
                04  K03-USERPG-ITEM
                        PIC X(20)   OCCURS  2 TIMES.
              03  K03-MEIPRTFLG-COMB.
                04  K03-MEIPRTFLG.
                  05  K03-VALUE   PIC X(24).
                04  K03-MEIPRTFLG-COUNT   PIC S9(9)   BINARY.
                04  K03-MEIPRTFLG-ITEM
                        PIC X(24)   OCCURS  3 TIMES.
              03  K03-OKUSURIFLG-COMB.
                04  K03-OKUSURIFLG.
                  05  K03-VALUE   PIC X(18).
                04  K03-OKUSURIFLG-COUNT   PIC S9(9)   BINARY.
                04  K03-OKUSURIFLG-ITEM
                        PIC X(18)   OCCURS  3 TIMES.
              03  K03-HENKIN-G.
                04  K03-HENKIN-STATE   PIC S9(9)   BINARY.
                04  K03-HENKIN   PIC X(10).
              03  K03-JYOGENMSG.
                04  K03-JYOGENMSG-STYLE   PIC X(20).
                04  K03-JYOGENMSG-VALUE   PIC X(30).
              03  K03-TEISEIMSG.
                04  K03-VALUE   PIC X(30).
              03  K03-SRYMEI14.
                04  K03-VALUE   PIC X(10).
              03  K03-SRYMEI15.
                04  K03-VALUE   PIC X(12).
              03  K03-GENMENMEI.
                04  K03-GENMENMEI-STYLE   PIC X(20).
                04  K03-GENMENMEI-VALUE   PIC X(34).
              03  K03-YYKHYOFLG-COMB.
                04  K03-YYKHYOFLG.
                  05  K03-VALUE   PIC X(18).
                04  K03-YYKHYOFLG-COUNT   PIC S9(9)   BINARY.
                04  K03-YYKHYOFLG-ITEM
                        PIC X(18)   OCCURS  5 TIMES.
              03  K03-B10.
                04  K03-B10-STATE   PIC S9(9)   BINARY.
                04  K03-B10-LABEL   PIC X(10).
              03  K03-B03.
                04  K03-B03-STATE   PIC S9(9)   BINARY.
                04  K03-B03-LABEL   PIC X(10).

