        02  KAID1.
     *****  02  KAID1-FIXED1.
              03  KAID1-ID1CODE.
                04  KAID1-VALUE PIC X(10).
              03  KAID1-ID1MSG.
                04  KAID1-VALUE PIC X(80).
