        02  KTERR.
      ***** 02  KTERR-FIXED1.
              03  KTERR-ERRCODE.
                04  KTERR-VALUE PIC X(10).
              03  KTERR-ERRMSG.
                04  KTERR-VALUE PIC X(80).
