        02  KTID1.
      ****  02  KTID1-FIXED1.
              03  KTID1-ID1CODE.
                04  KTID1-VALUE PIC X(10).
              03  KTID1-ID1MSG.
                04  KTID1-VALUE PIC X(80).
              03  KTID1-B01.
                04  KID1-LABEL  PIC X(4).
              03  KTID1-B12.
                04  KID1-LABEL  PIC X(4).
