        02  N21FIL.
           03 N21FIL-FIXED.
            04  N21FIL-FILEENTRY1.
              05  N21FIL-PHOTOAREA   PIC X(36).
              05  N21FIL-PHOTO       PIC X(256).
