        02  N41ERR.
     *****  02  N41ERR-FIXED1.
              03  N41ERR-ERRCODE.
                04  N41ERR-VALUE    PIC X(10).
              03  N41ERR-ERRMSG.
                04  N41ERR-VALUE    PIC X(80).
