      *******************************************************************
      * Project code name "ORCA"
      * 日医標準レセプトソフト（JMA standard receipt software）
      * Copyright(C) 2002 JMA (Japan Medical Association)
      *
      * This program is part of "JMA standard receipt software".
      *
      *     This program is distributed in the hope that it will be useful
      * for further advancement in medical care, according to JMA Open
      * Source License, but WITHOUT ANY WARRANTY.
      *     Everyone is granted permission to use, copy, modify and
      * redistribute this program, but only under the conditions described
      * in the JMA Open Source License. You should have received a copy of
      * this license along with this program. If not, stop using this
      * program and contact JMA, 2-28-16 Honkomagome, Bunkyo-ku, Tokyo,
      * 113-8621, Japan.
      ********************************************************************
      *    orca51（月次・月次統計）画面
      ******************************************************************
           COPY    "L01.INC".
           COPY    "L02.INC".
           COPY    "L03.INC".
           COPY    "L04.INC".
           COPY    "L06.INC".
           COPY    "L07.INC".
           COPY    "L99.INC".
           COPY    "L100.INC".
           COPY    "LERR.INC".
           COPY    "LID1.INC".
           COPY    "LID2.INC".
           COPY    "G01.INC".
           COPY    "G02.INC".
           COPY    "G03.INC".
           COPY    "G05.INC".
           COPY    "G07.INC".
           COPY    "G99.INC".
           COPY    "G100.INC".
           COPY    "GERR.INC".
           COPY    "GID1.INC".
           COPY    "GID2.INC".
           COPY    "CPAPILSTV2.INC".
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST02-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST03-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST04-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST05-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST06-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST07-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST08-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST09-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST10-//.
           COPY    "CPAPILSTV2.INC"    REPLACING
                                       //APILST-// BY //APILST11-//.
