        02  Q04.
          03  Q04-TITLE        PIC X(20).
          03  Q04-TITLEKBN     PIC X(01).
          03  Q04-LBLRENNUM    PIC X(10).
          03  Q04-RENNUM-VISIBLE
                               PIC X(01).
          03  Q04-RENNUM-STATE PIC S9(9)   BINARY.
          03  Q04-RENNUM       PIC S9(03).
          03  Q04-NAME         PIC X(100).
