        02  W36.
            03  W36-TITLE   PIC X(256).
            03  W36-POPUP-SUMMARY   PIC X(256).
            03  W36-POPUP-BODY  PIC X(1024).
            03  W36-POPUP-ICON  PIC X(256).
            03  W36-POPUP-TIMEOUT   PIC S9(9)   BINARY.
            03  W36-FIXED1.
              04  W36-HKNCHK.
                05  W36-VALUE   PIC X.
              04  W36-MEMO1.
                05  W36-VALUE   PIC X.
              04  W36-MEMO2.
                05  W36-VALUE   PIC X.
