        02  XE01.
      ***** 02  XE01-FIXED10.
              03  XE01-SEIDO-KBN.
                04  XE01-VALUE  PIC X(3).
              03  XE01-KIGONUM.
                04  XE01-VALUE  PIC X(20).
              03  XE01-HONKZKKBN.
                04  XE01-VALUE  PIC X(1).
              03  XE01-KANANAME.
                04  XE01-VALUE  PIC X(28).
              03  XE01-SEX.
                04  XE01-VALUE  PIC X(1).
              03  XE01-BIRTHDAY.
                04  XE01-VALUE  PIC X(7).
              03  XE01-NIN.
                04  XE01-VALUE  PIC X(100).
              03  XE01-HKNNUM.
                04  XE01-VALUE  PIC X(8).
