        02  XFID2.
      ***** 02  XFID2-FIXED1.
              03  XFID2-ID2CODE.
                04  XFID2-VALUE PIC X(10).
              03  XFID2-ID2MSG.
                04  XFID2-VALUE PIC X(80).
