--                       --
-- システム管理          --
-- 日レセ対応帳票追加    --
--                       --
-- 2005/07/21            --
--                       --

COPY "tbl_syskanri" from stdin ;
0044	1018    	00000000	99999999	外来月別請求書（自費１０項目対応）                                                                                                                              ORCBG013V02             診療年月            YM        発行方法            PSN1      患者番号            PTNUM     伝票発行日          YMD       発行区分            PSN1                                                                                                                                                            11211		20050721	20050721
\.
