--                       --
-- システム管理          --
-- 日レセ対応帳票追加    --
--                       --
-- 2005/07/29            --
--                       --

COPY "tbl_syskanri" FROM stdin;
0043	1007    	00000000	99999999	収納一覧表（外来）（期間指定対応版）                                                                                                                            ORCBD004V02             処理区分            PSN1                                                                                                                                                                                                                                                                                    1			20050729	20050729	174049
0043	1008    	00000000	99999999	収納一覧表（入院）（期間指定対応版）                                                                                                                            ORCBD005V02             処理区分            PSN1                                                                                                                                                                                                                                                                                    1			20050729	20050729	174106
\.
