--                                    --
-- システム管理データ更新             --
-- 病棟特定入院料 5110                --
-- 病室特定入院料 5111                --
--                                    --
--                                    --
-- Create Date : 2008/03/07           --
--                                    --
\set ON_ERROR_STOP

delete from tbl_syskanri where kanricd = '5110' ;
delete from tbl_syskanri where kanricd = '5111' and kbncd = '02';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '15' and styukymd = '00000000' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '15' and styukymd = '00000000' and edyukymd = '20080331';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '18' and styukymd = '20040401' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '18' and styukymd = '20040401' and edyukymd = '20080331';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '18' and styukymd = '20080401' ;
delete from tbl_syskanri where kanricd = '5111' and kbncd = '52' and styukymd = '20080401' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '53' and styukymd = '20080401' and edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd = '54' and styukymd = '20080401' and edyukymd = '99999999';   
delete from tbl_syskanri where kanricd ='5111' and kbncd = '22' and styukymd = '00000000' and  edyukymd = '99999999';
delete from tbl_syskanri where kanricd ='5111' and kbncd = '22' and styukymd = '00000000' and  edyukymd = '20060331';
delete from tbl_syskanri where kanricd ='5111' and kbncd = '22' and styukymd = '20060401' and  edyukymd = '20080331';
delete from tbl_syskanri where kanricd ='5111' and kbncd = '22' and styukymd = '20080401' and  edyukymd = '99999999';
delete from tbl_syskanri where kanricd ='5111' and kbncd = '24' and styukymd = '00000000' and  edyukymd = '99999999';
delete from tbl_syskanri where kanricd ='5111' and kbncd = '24' and styukymd = '00000000' and  edyukymd = '20060331';
delete from tbl_syskanri where kanricd ='5111' and kbncd = '24' and styukymd = '20060401' and  edyukymd = '20080331';
delete from tbl_syskanri where kanricd ='5111' and kbncd = '24' and styukymd = '20080401' and  edyukymd = '99999999';
delete from tbl_syskanri where kanricd = '5111' and kbncd between '25' and '48';

delete from tbl_syskanri where hospnum = 0;


COPY tbl_syskanri (kanricd, kbncd, styukymd, edyukymd, kanritbl, termid, opid, creymd, upymd, uphms, hospnum) FROM stdin;
5110	01      	00000000	20080331	190111110小児入院医療管理料１                                        小入管１			        	        	      	0
5110	01      	20080401	99999999	190111110小児入院医療管理料２                                        小入管２			        	        	      	0
5110	02      	00000000	20080331	190111210小児入院医療管理料２                                        小入管２			        	        	      	0
5110	02      	20080401	99999999	190111210小児入院医療管理料３                                        小入管３			        	        	      	0
5110	03      	00000000	20080331	190055210特殊疾患療養病棟入院料１                                    特殊療養１			        	        	      	0
5110	03      	20080401	99999999	190055210特殊疾患病棟入院料１                                        特殊疾患１			        	        	      	0
5110	04      	00000000	20080331	190055310特殊疾患療養病棟入院料２                                    特殊療養２			        	        	      	0
5110	04      	20080401	99999999	190055310特殊疾患病棟入院料２                                        特殊疾患２			        	        	      	0
5110	05      	00000000	20040331	190739910老人性認知症疾患治療病棟入院料                              老認知			        	        	      	0
5110	06      	00000000	20060331	190740110老人性認知症疾患療養病棟入院料                              老認療			        	        	      	0
5110	07      	00000000	20060331	190055010精神療養病棟入院料１                                        精神療養１			        	        	      	0
5110	07      	20060401	99999999	190055010精神療養病棟入院料                                          精神療養			        	        	      	0
5110	08      	00000000	20060331	190055110精神療養病棟入院料２                                        精神療養２			        	        	      	0
5110	09      	00000000	99999999	190028910緩和ケア病棟入院料                                          緩和ケア			        	        	      	0
5110	10      	00000000	20080331	190111410精神科救急入院料                                            精神救急			        	        	      	0
5110	10      	20080401	99999999	190111410精神科救急入院料１                                          精神救急１			        	        	      	0
5110	11      	00000000	99999999	190066910精神科急性期治療病棟入院料１                                精神急性１			        	        	      	0
5110	12      	00000000	99999999	190067010精神科急性期治療病棟入院料２                                精神急性２			        	        	      	0
5110	13      	00000000	20080930	190075910回復期リハビリテーション病棟                                回復期リハ			        	        	      	0
5110	14      	00000000	20080331	190075810小児入院医療管理料３                                        小入管３			        	        	      	0
5110	14      	20080401	99999999	190075810小児入院医療管理料４                                        小入管４			        	        	      	0
5110	16      	20061001	20080930	190124910回復期リハビリテーション病棟（生活療養）                    回復期リハ（生活療養）  1			        	        	      	0
5110	17      	20080401	99999999	190129310小児入院医療管理料１                                        小入管１			        	        	      	0
5110	18      	20080401	99999999	190129410回復期リハビリテーション病棟１                              回復期リハ１			        	        	      	0
5110	19      	20080401	99999999	190129510回復期リハビリテーション病棟１（生活療養）                  回復期リハ１（生活療養）1			        	        	      	0
5110	20      	20080401	99999999	190129610回復期リハビリテーション病棟２                              回復期リハ２			        	        	      	0
5110	21      	20080401	99999999	190129710回復期リハビリテーション病棟２（生活療養）                  回復期リハ２（生活療養）1			        	        	      	0
5110	22      	20080401	99999999	190130010精神科救急入院料２                                          精神救急２			        	        	      	0
5110	23      	20080401	99999999	190130210精神科救急・合併症入院料                                    精神救急・合併症			        	        	      	0
5110	05      	20040401	20080331	190739910老人性認知症疾患治療病棟入院料１                            老認知１			        	        	      	0
5110	05      	20080401	99999999	190739910認知症病棟入院料１                                          認知１			        	        	      	0
5110	15      	20040401	20080331	190813410老人性認知症疾患治療病棟入院料２                            老認知２			        	        	      	0
5110	15      	20080401	99999999	190813410認知症病棟入院料２                                          認知２			        	        	      	0
5111	02      	00000000	20080331	190774110診療所老人医療管理料                                        診老管                  01			        	        	      	0
5111	02      	20080401	99999999	190774110診療所後期高齢者医療管理料                                  診後管                  01			        	        	      	0
5111	15      	00000000	20080331	190788810老人一般病棟入院医療管理料                                  老入管                  01			        	        	      	0
5111	18      	20040401	20080331	190117410亜急性期入院医療管理料                                      亜急性期                01			        	        	      	0
5111	18      	20080401	99999999	190117410亜急性期入院医療管理料１                                    亜急性期１              01			        	        	      	0
5111	52      	20080401	99999999	190130410短期滞在手術基本料３                                        短期滞在３              02			        	        	      	0
5111	53      	20080401	99999999	190130510短期滞在手術基本料３（生活療養）                            短期滞在３（生活療養）  021			        	        	      	0
5111	54      	20080401	99999999	190130210亜急性期入院医療管理料２                                    亜急性期２              01			        	        	      	0
5111	22      	00000000	20060331	190799410老人一般病棟特定入院基本料                                  老人特定                03			        	        	      	0
5111	22      	20060401	20080331	190799410老人特定入院基本料                                          老人特定                03			        	        	      	0
5111	22      	20080401	99999999	190799410後期高齢者特定入院基本料                                    後期特定                03			        	        	      	0
5111	24      	00000000	20060331	190799510老人一般病棟特定入院基本料（老人特別入院基本料算定患者）    老人特定（老特入基算定）03			        	        	      	0
5111	24      	20060401	20080331	190799510老人特定入院基本料（老人特別入院基本料算定患者）            老人特定（老特入基算定）03			        	        	      	0
5111	24      	20080401	99999999	190799510後期高齢者特定入院基本料（特別入院基本料算定患者）          後期特定（特別入基算定）03			        	        	      	0
5111	25      	20060701	20080331	190121310療養病棟入院基本料２（入院基本料Ａ）                        療養(Ａ）               05			        	        	      	0
5111	26      	20060701	20080331	190121410療養病棟入院基本料２（入院基本料Ｂ）                        療養(Ｂ）               05			        	        	      	0
5111	27      	20060701	20080331	190121510療養病棟入院基本料２（入院基本料Ｃ）                        療養(Ｃ）               05			        	        	      	0
5111	28      	20060701	20080331	190121610療養病棟入院基本料２（入院基本料Ｄ）                        療養(Ｄ）               05			        	        	      	0
5111	29      	20060701	20080331	190121710療養病棟入院基本料２（入院基本料Ｅ）                        療養(Ｅ）               05			        	        	      	0
5111	30      	20060701	20080331	190121810療養病棟入院基本料２（特別入院基本料）                      療養(特別）             05			        	        	      	0
5111	31      	20060701	20080331	190122010有床診療所療養病床入院基本料２（入院基本料Ａ）              療養(Ａ）               06			        	        	      	0
5111	32      	20060701	20080331	190122110有床診療所療養病床入院基本料２（入院基本料Ｂ）              療養(Ｂ）               06			        	        	      	0
5111	33      	20060701	20080331	190122210有床診療所療養病床入院基本料２（入院基本料Ｃ）              療養(Ｃ）               06			        	        	      	0
5111	34      	20060701	20080331	190122310有床診療所療養病床入院基本料２（入院基本料Ｄ）              療養(Ｄ）               06			        	        	      	0
5111	35      	20060701	20080331	190122410有床診療所療養病床入院基本料２（入院基本料Ｅ）              療養(Ｅ）               06			        	        	      	0
5111	36      	20060701	20080331	190122510有床診療所療養病床入院基本料２（特別入院基本料）            療養(特別）             06			        	        	      	0
5111	37      	20061001	20080331	190123710療養病棟入院基本料２（入院基本料Ａ）（生活療養）            療養(Ａ）（生活療養）   051			        	        	      	0
5111	38      	20061001	20080331	190123810療養病棟入院基本料２（入院基本料Ｂ）（生活療養）            療養(Ｂ）（生活療養）   051			        	        	      	0
5111	39      	20061001	20080331	190123910療養病棟入院基本料２（入院基本料Ｃ）（生活療養）            療養(Ｃ）（生活療養）   051			        	        	      	0
5111	40      	20061001	20080331	190124010療養病棟入院基本料２（入院基本料Ｄ）（生活療養）            療養(Ｄ）（生活療養）   051			        	        	      	0
5111	41      	20061001	20080331	190124110療養病棟入院基本料２（入院基本料Ｅ）（生活療養）            療養(Ｅ）（生活療養）   051			        	        	      	0
5111	42      	20061001	20080331	190124210療養病棟入院基本料２（特別入院基本料）（生活療養）          療養(特別）（生活療養） 051			        	        	      	0
5111	43      	20061001	20080331	190124310有床診療所療養病床入院基本料２（入院基本料Ａ）（生活療養）  療養(Ａ）（生活療養）   061			        	        	      	0
5111	44      	20061001	20080331	190124410有床診療所療養病床入院基本料２（入院基本料Ｂ）（生活療養）  療養(Ｂ）（生活療養）   061			        	        	      	0
5111	45      	20061001	20080331	190124510有床診療所療養病床入院基本料２（入院基本料Ｃ）（生活療養）  療養(Ｃ）（生活療養）   061			        	        	      	0
5111	46      	20061001	20080331	190124610有床診療所療養病床入院基本料２（入院基本料Ｄ）（生活療養）  療養(Ｄ）（生活療養）   061			        	        	      	0
5111	47      	20061001	20080331	190124710有床診療所療養病床入院基本料２（入院基本料Ｅ）（生活療養）  療養(Ｅ）（生活療養）   061			        	        	      	0
5111	48      	20061001	20080331	190124810有床診療所療養病床入院基本料２（特別入院基本料）（生活療養）療養(特別）（生活療養） 061			        	        	      	0
5111	25      	20080401	99999999	190121310療養病棟入院基本料（入院基本料Ａ）                          療養(Ａ）               05			        	        	      	0
5111	26      	20080401	99999999	190121410療養病棟入院基本料（入院基本料Ｂ）                          療養(Ｂ）               05			        	        	      	0
5111	27      	20080401	99999999	190121510療養病棟入院基本料（入院基本料Ｃ）                          療養(Ｃ）               05			        	        	      	0
5111	28      	20080401	99999999	190121610療養病棟入院基本料（入院基本料Ｄ）                          療養(Ｄ）               05			        	        	      	0
5111	29      	20080401	99999999	190121710療養病棟入院基本料（入院基本料Ｅ）                          療養(Ｅ）               05			        	        	      	0
5111	30      	20080401	99999999	190121810療養病棟入院基本料（特別入院基本料）                        療養(特別）             05			        	        	      	0
5111	31      	20080401	99999999	190122010有床診療所療養病床入院基本料（入院基本料Ａ）                療養(Ａ）               06			        	        	      	0
5111	32      	20080401	99999999	190122110有床診療所療養病床入院基本料（入院基本料Ｂ）                療養(Ｂ）               06			        	        	      	0
5111	33      	20080401	99999999	190122210有床診療所療養病床入院基本料（入院基本料Ｃ）                療養(Ｃ）               06			        	        	      	0
5111	34      	20080401	99999999	190122310有床診療所療養病床入院基本料（入院基本料Ｄ）                療養(Ｄ）               06			        	        	      	0
5111	35      	20080401	99999999	190122410有床診療所療養病床入院基本料（入院基本料Ｅ）                療養(Ｅ）               06			        	        	      	0
5111	36      	20080401	99999999	190122510有床診療所療養病床入院基本料（特別入院基本料）              療養(特別）             06			        	        	      	0
5111	37      	20080401	99999999	190123710療養病棟入院基本料（入院基本料Ａ）（生活療養）              療養(Ａ）（生活療養）   051			        	        	      	0
5111	38      	20080401	99999999	190123810療養病棟入院基本料（入院基本料Ｂ）（生活療養）              療養(Ｂ）（生活療養）   051			        	        	      	0
5111	39      	20080401	99999999	190123910療養病棟入院基本料（入院基本料Ｃ）（生活療養）              療養(Ｃ）（生活療養）   051			        	        	      	0
5111	40      	20080401	99999999	190124010療養病棟入院基本料（入院基本料Ｄ）（生活療養）              療養(Ｄ）（生活療養）   051			        	        	      	0
5111	41      	20080401	99999999	190124110療養病棟入院基本料（入院基本料Ｅ）（生活療養）              療養(Ｅ）（生活療養）   051			        	        	      	0
5111	42      	20080401	99999999	190124210療養病棟入院基本料（特別入院基本料）（生活療養）            療養(特別）（生活療養） 051			        	        	      	0
5111	43      	20080401	99999999	190124310有床診療所療養病床入院基本料（入院基本料Ａ）（生活療養）    療養(Ａ）（生活療養）   061			        	        	      	0
5111	44      	20080401	99999999	190124410有床診療所療養病床入院基本料（入院基本料Ｂ）（生活療養）    療養(Ｂ）（生活療養）   061			        	        	      	0
5111	45      	20080401	99999999	190124510有床診療所療養病床入院基本料（入院基本料Ｃ）（生活療養）    療養(Ｃ）（生活療養）   061			        	        	      	0
5111	46      	20080401	99999999	190124610有床診療所療養病床入院基本料（入院基本料Ｄ）（生活療養）    療養(Ｄ）（生活療養）   061			        	        	      	0
5111	47      	20080401	99999999	190124710有床診療所療養病床入院基本料（入院基本料Ｅ）（生活療養）    療養(Ｅ）（生活療養）   061			        	        	      	0
5111	48      	20080401	99999999	190124810有床診療所療養病床入院基本料（特別入院基本料）（生活療養）  療養(特別）（生活療養） 061			        	        	      	0
\.

insert into tbl_syskanri
select 
a.kanricd,
a.kbncd,
a.styukymd,
a.edyukymd,
a.kanritbl,
a.termid,
a.opid,
a.creymd,
a.upymd,
a.uphms,
b.hospnum
from tbl_syskanri a,tbl_sysbase b
where 
    a.hospnum = 0 ;

delete from tbl_syskanri where hospnum = 0;



