--                                              --
-- 平成２０年度改定入院基本データ追加           --
--                                              --
-- 一般病棟準７対１入院基本料                   --
-- 一般病棟準７対１入院基本料（離島等）         --
-- 結核病棟準７対１入院基本料                   --
-- 結核病棟準７対１入院基本料（離島等）         --
-- 専門病院準７対１入院基本料                   --
-- 専門病院準７対１入院基本料（離島等）         --
-- 結核病棟特別入院基本料（１３対１入院基本料） --
-- 障害者施設等７対１入院基本料                 --
--                                              --
-- Create Date : 2008/03/06                     --
--                                              --
\set ON_ERROR_STOP

delete from tbl_nyuinkhn where khn_srycd = '190125410' and yukostymd = '20080701';
delete from tbl_nyuinkhn where khn_srycd = '190125510' and yukostymd = '20080701';
delete from tbl_nyuinkhn where khn_srycd = '190125810' and yukostymd = '20080701';
delete from tbl_nyuinkhn where khn_srycd = '190125910' and yukostymd = '20080701';
delete from tbl_nyuinkhn where khn_srycd = '190126110' and yukostymd = '20080701';
delete from tbl_nyuinkhn where khn_srycd = '190126210' and yukostymd = '20080701';
delete from tbl_nyuinkhn where khn_srycd = '190126010' and yukostymd = '20080401';
delete from tbl_nyuinkhn where khn_srycd = '190126310' and yukostymd = '20080401';

COPY "tbl_nyuinkhn" FROM stdin;
190125410	20080701	99999999	1	 	  	  	  	  	  	1495	190079470	190079670	         	         	         	         	         	428	192	0	0	0	0	0	1923	1687	1495	1495	1495	1495	1495			        	        	      
190125510	20080701	99999999	1	 	  	  	  	  	  	1525	190079470	190079670	         	         	         	         	         	428	192	0	0	0	0	0	1953	1717	1525	1525	1525	1525	1525			        	        	      
190125810	20080701	99999999	1	 	  	  	  	  	  	1387	190118070	190083370	190083570	         	         	         	         	400	300	100	0	0	0	0	1787	1687	1487	1387	1387	1387	1387			        	        	      
190125910	20080701	99999999	1	 	  	  	  	  	  	1417	190118070	190083370	190083570	         	         	         	         	400	300	100	0	0	0	0	1817	1717	1517	1417	1417	1417	1417			        	        	      
190126110	20080701	99999999	1	 	  	  	  	  	  	1495	190092270	190092470	         	         	         	         	         	452	207	0	0	0	0	0	1947	1702	1495	1495	1495	1495	1495			        	        	      
190126210	20080701	99999999	1	 	  	  	  	  	  	1525	190092270	190092470	         	         	         	         	         	452	207	0	0	0	0	0	1977	1732	1525	1525	1525	1525	1525			        	        	      
190126010	20080401	99999999	1	 	  	  	  	  	  	550	190118110	190083470	190122770	         	         	         	         	320	240	100	0	0	0	0	870	790	650	550	550	550	550			        	        	      
190126310	20080401	99999999	1	 	  	  	  	  	  	1555	190095770	190095970	         	         	         	         	         	312	167	0	0	0	0	0	1867	1722	1555	1555	1555	1555	1555			        	        	      
\.
