--                                                         --
-- Ê¿À®£²£²Ç¯ÅÙ²şÄêÆş±¡Î¬¾Î¥Æ¡¼¥Ö¥ë                        --
--                                                         --
-- ¡ÊÆş±¡´ğËÜÎÁ¡Ë                                          --
-- °ìÈÌÉÂÅï£·ÂĞ£±ÆÃÊÌÆş±¡´ğËÜÎÁ   (190131310)              --
-- °ìÈÌÉÂÅï£±£°ÂĞ£±ÆÃÊÌÆş±¡´ğËÜÎÁ (190131410)              --
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Á¡Ë         (190121310)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Á¡Ë¡ÊÀ¸³è¡Ë (190123710)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Â¡Ë         (190121410)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Â¡Ë¡ÊÀ¸³è¡Ë (190123810)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Ã¡Ë         (190121510)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Ã¡Ë¡ÊÀ¸³è¡Ë (190123910)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Ä           (190121610)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Ä¡Ë¡ÊÀ¸³è¡Ë (190124010)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Å¡Ë         (190121710)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Å¡Ë¡ÊÀ¸³è¡Ë (190124110)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Æ¡Ë         (190131610)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Æ¡Ë¡ÊÀ¸³è¡Ë (190131710)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Ç¡Ë         (190131810)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£Ç¡Ë¡ÊÀ¸³è¡Ë (190131910)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£È¡Ë         (190132010)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£È¡Ë¡ÊÀ¸³è¡Ë (190132110)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£É¡Ë         (190132210)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£±¡ÊÆş±¡´ğËÜÎÁ£É¡Ë¡ÊÀ¸³è¡Ë (190132310)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Á¡Ë         (190132410)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Á¡Ë¡ÊÀ¸³è¡Ë (190132510)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Â¡Ë         (190132610)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Â¡Ë¡ÊÀ¸³è¡Ë (190132710)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Ã¡Ë         (190132810)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Ã¡Ë¡ÊÀ¸³è¡Ë (190132910)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Ä¡Ë         (190133010)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Ä¡Ë¡ÊÀ¸³è¡Ë (190133110)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Å¡Ë         (190133210)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Å¡Ë¡ÊÀ¸³è¡Ë (190133310)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Æ¡Ë         (190133410)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Æ¡Ë¡ÊÀ¸³è¡Ë (190133510)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Ç¡Ë         (190133610)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£Ç¡Ë¡ÊÀ¸³è¡Ë (190133710)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£È¡Ë         (190133810)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£È¡Ë¡ÊÀ¸³è¡Ë (190133910)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£É¡Ë         (190134010)--
-- ÎÅÍÜÉÂÅïÆş±¡´ğËÜÎÁ£²¡ÊÆş±¡´ğËÜÎÁ£É¡Ë¡ÊÀ¸³è¡Ë (190134110)--
-- ·ë³ËÉÂÅï£·ÂĞ£±ÆÃÊÌÆş±¡´ğËÜÎÁ   (190134310)              --
-- ·ë³ËÉÂÅï£±£°ÂĞ£±ÆÃÊÌÆş±¡´ğËÜÎÁ (190134410)              --
-- ·ë³ËÉÂÅïÆÃÊÌÆş±¡´ğËÜÎÁ¡Ê£·ÂĞ£±Æş±¡´ğËÜÎÁ¡Ë (190126010) ÂĞ½èÏ³¤ìÊ¬ --
-- Àº¿ÀÉÂÅï£±£³ÂĞ£±Æş±¡´ğËÜÎÁ     (190134510)              --
-- Àº¿ÀÉÂÅï£±£°ÂĞ£±ÆÃÊÌÆş±¡´ğËÜÎÁ (190134610)              --
-- ÆÃÄêµ¡Ç½ÉÂ±¡Àº¿ÀÉÂÅï£±£³ÂĞ£±Æş±¡´ğËÜÎÁ (190134710)      --
-- Í­¾²¿ÇÎÅ½êÆş±¡´ğËÜÎÁ£³ (190135110 - 190135310)          --
--                                                         --
-- ¡ÊÆş±¡ÎÁ²Ã»»¡Ë                                          --
-- Áí¹çÆş±¡ÂÎÀ©²Ã»» (190098870)                            --
-- £±£µÂĞ£±Êä½õÂÎÀ©²Ã»» (190135710)                        --
-- £²£°ÂĞ£±Êä½õÂÎÀ©²Ã»» (190135810)                        --
-- µŞÀ­´ü´Ç¸îÊä½õÂÎÀ©²Ã»»£±(190135910)                     --
-- µŞÀ­´ü´Ç¸îÊä½õÂÎÀ©²Ã»»£²(190136010)                     --
-- ¶¯ÅÙ¹ÔÆ°¾ã³²Æş±¡°åÎÅ´ÉÍı²Ã»»(190136310)                 --
-- ½ÅÅÙ¥¢¥ë¥³¡¼¥ë°ÍÂ¸¾ÉÆş±¡°åÎÅ´ÉÍı²Ã»»(190136410-190136510)   --
-- Àİ¿©¾ã³²Æş±¡°åÎÅ´ÉÍı²Ã»»(190136610-190136710)           --
-- ±ÉÍÜ¥µ¥İ¡¼¥È¥Á¡¼¥à²Ã»»(190136810)                       --
-- °åÎÅ°ÂÁ´ÂĞºö²Ã»»£±(190120510)                           --
-- °åÎÅ°ÂÁ´ÂĞºö²Ã»»£²(190136910)                           --
-- ´¶À÷ËÉ»ßÂĞºö²Ã»»(190137070)                             --
-- ËıÀ­´üÉÂÅïÅùÂà±¡Ä´À°²Ã»»£±¡ÊÂà±¡»Ù±ç·×²èºîÀ®²Ã»»¡Ë(190137110) --
-- ËıÀ­´üÉÂÅïÅùÂà±¡Ä´À°²Ã»»£±¡ÊÂà±¡²Ã»»¡¦ÎÅÍÜÉÂÅï¡Ë  (190137210) --
-- ËıÀ­´üÉÂÅïÅùÂà±¡Ä´À°²Ã»»£±¡ÊÂà±¡²Ã»»¡¦¾ã³²¼Ô»ÜÀß¡Ë(190137310) --
-- ËıÀ­´üÉÂÅïÅùÂà±¡Ä´À°²Ã»»£²¡ÊÂà±¡»Ù±ç·×²èºîÀ®²Ã»»¡Ë(190128210) --
-- ËıÀ­´üÉÂÅïÅùÂà±¡Ä´À°²Ã»»£²¡ÊÂà±¡²Ã»»¡¦ÎÅÍÜÉÂÅï¡Ë  (190128310) --
-- ËıÀ­´üÉÂÅïÅùÂà±¡Ä´À°²Ã»»£²¡ÊÂà±¡²Ã»»¡¦¾ã³²¼Ô»ÜÀß¡Ë(190128410) --
-- µŞÀ­´üÉÂÅïÅùÂà±¡Ä´À°²Ã»»£± (190137410)                  --
-- µŞÀ­´üÉÂÅïÅùÂà±¡Ä´À°²Ã»»£² (190137510)                  --
-- ¿·À¸»ùÆÃÄê½¸Ãæ¼£ÎÅ¼¼Âà±¡Ä´À°²Ã»» (190137610)            --
-- µßµŞÈÂÁ÷´µ¼ÔÃÏ°èÏ¢·È¾Ò²ğ²Ã»» (190137710)                --
-- µßµŞÈÂÁ÷´µ¼ÔÃÏ°èÏ¢·È¼õÆş²Ã»» (190137810)                --
-- Áí¹çÉ¾²Á²Ã»» (190814010)                                --
-- ¸ÆµÛ¥±¥¢¥Á¡¼¥à²Ã»» (190137910)                          --
-- ¸åÈ¯°åÌôÉÊ»ÈÍÑÂÎÀ©²Ã»» (190138010)                      --
--                                                         --
-- ¡ÊÆÃÄêÆş±¡ÎÁ¡Ë                                          --
-- µßÌ¿µßµŞÆş±¡ÎÁ£³¡ÊµßÌ¿µßµŞÆş±¡ÎÁ¡Ë(190138110-190138310) --
-- µßÌ¿µßµŞÆş±¡ÎÁ£³¡Ê¹­ÈÏ°ÏÇ®½ı¡Ë    (190138410-190138610) --
-- µßÌ¿µßµŞÆş±¡ÎÁ£´¡ÊµßÌ¿µßµŞÆş±¡ÎÁ¡Ë(190138710-190138910) --
-- µßÌ¿µßµŞÆş±¡ÎÁ£´¡Ê¹­ÈÏ°ÏÇ®½ı¡Ë    (190139010-190139310) --
-- ÆÃÄê½¸Ãæ¼£ÎÅ¼¼´ÉÍıÎÁ£±            (190116310-190116410) --
-- ÆÃÄê½¸Ãæ¼£ÎÅ¼¼´ÉÍıÎÁ£²¡ÊÆÃÄê½¸Ãæ¼£ÎÅ¡Ë (190139810-190139910) --
-- ÆÃÄê½¸Ãæ¼£ÎÅ¼¼´ÉÍıÎÁ£²¡Ê¹­ÈÏ°ÏÇ®½ı¡Ë (190140010-190140110) --
-- ¿·À¸»ùÆÃÄê½¸Ãæ¼£ÎÅ¼¼´ÉÍıÎÁ£±  (190024710)               --
-- ¿·À¸»ùÆÃÄê½¸Ãæ¼£ÎÅ¼¼´ÉÍıÎÁ£²  (190140410)               --
-- ¿·À¸»ù¼£ÎÅ²óÉü¼¼Æş±¡°åÎÅ´ÉÍıÎÁ              (190140510) --
-- ¾®»ùÆş±¡°åÎÅ´ÉÍıÎÁ£±¤«¤é£µ    (190129310-190075810)     --
-- ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÆş±¡ÎÁ£±            (190141610) --
-- ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÆş±¡ÎÁ£±¡ÊÀ¸³èÎÅÍÜ¡Ë(190141710) --
-- ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÆş±¡ÎÁ£²            (190141810) --
-- ²óÉü´ü¥ê¥Ï¥Ó¥ê¥Æ¡¼¥·¥ç¥óÆş±¡ÎÁ£²¡ÊÀ¸³èÎÅÍÜ¡Ë(190141910) --
--                                                         --
--                                                         --
-- °Ê²¼Æş±¡ÎÁ¤ÏÊ¿À®£²£²Ç¯£³·îÇÑ»ß¤À¤¬¡¢º£²óÂĞ½è¤Ï¹Ô¤ï¤Ê¤¤  --
-- °ìÈÌÉÂÅï½à£·ÂĞ£±Æş±¡´ğËÜÎÁ           (190125410)        --
-- °ìÈÌÉÂÅï½à£·ÂĞ£±Æş±¡´ğËÜÎÁ¡ÊÎ¥ÅçÅù¡Ë (190125510)        --
-- ·ë³ËÉÂÅï½à£·ÂĞ£±Æş±¡´ğËÜÎÁ           (190125810)        --
-- ·ë³ËÉÂÅï½à£·ÂĞ£±Æş±¡´ğËÜÎÁ¡ÊÎ¥ÅçÅù¡Ë (190125910)        --
-- ÀìÌçÉÂ±¡½à£·ÂĞ£±Æş±¡´ğËÜÎÁ           (190126110)        --
-- ÀìÌçÉÂ±¡½à£·ÂĞ£±Æş±¡´ğËÜÎÁ¡ÊÎ¥ÅçÅù¡Ë (190126210)        --
-- ¹­ÈÏ°ÏÇ®½ıÆÃÄê½¸Ãæ¼£ÎÅ¼¼´ÉÍıÎÁ  (190024810)             --
-- ÆÃÄê½¸Ãæ¼£ÎÅ¼¼´ÉÍıÎÁ¡Ê½Å¾É¼ÔÅùÈæÎ¨´ğ½àÅ¬¹ç¡Ë(190024610-190074610) --
--                                              --
-- Create Date : 2010/04/07                     --
--                                              --
\set ON_ERROR_STOP

delete from tbl_nyuinryakusho where srycd = '190131310';
delete from tbl_nyuinryakusho where srycd = '190131410';
delete from tbl_nyuinryakusho where srycd = '190121310';
delete from tbl_nyuinryakusho where srycd = '190123710';
delete from tbl_nyuinryakusho where srycd = '190121410';
delete from tbl_nyuinryakusho where srycd = '190123810';
delete from tbl_nyuinryakusho where srycd = '190121510';
delete from tbl_nyuinryakusho where srycd = '190123910';
delete from tbl_nyuinryakusho where srycd = '190121610';
delete from tbl_nyuinryakusho where srycd = '190124010';
delete from tbl_nyuinryakusho where srycd = '190121710';
delete from tbl_nyuinryakusho where srycd = '190124110';
delete from tbl_nyuinryakusho where srycd = '190131610';
delete from tbl_nyuinryakusho where srycd = '190131710';
delete from tbl_nyuinryakusho where srycd = '190131810';
delete from tbl_nyuinryakusho where srycd = '190131910';
delete from tbl_nyuinryakusho where srycd = '190132010';
delete from tbl_nyuinryakusho where srycd = '190132110';
delete from tbl_nyuinryakusho where srycd = '190132210';
delete from tbl_nyuinryakusho where srycd = '190132310';
delete from tbl_nyuinryakusho where srycd = '190132410';
delete from tbl_nyuinryakusho where srycd = '190132510';
delete from tbl_nyuinryakusho where srycd = '190132610';
delete from tbl_nyuinryakusho where srycd = '190132710';
delete from tbl_nyuinryakusho where srycd = '190132810';
delete from tbl_nyuinryakusho where srycd = '190132910';
delete from tbl_nyuinryakusho where srycd = '190133010';
delete from tbl_nyuinryakusho where srycd = '190133110';
delete from tbl_nyuinryakusho where srycd = '190133210';
delete from tbl_nyuinryakusho where srycd = '190133310';
delete from tbl_nyuinryakusho where srycd = '190133410';
delete from tbl_nyuinryakusho where srycd = '190133510';
delete from tbl_nyuinryakusho where srycd = '190133610';
delete from tbl_nyuinryakusho where srycd = '190133710';
delete from tbl_nyuinryakusho where srycd = '190133810';
delete from tbl_nyuinryakusho where srycd = '190133910';
delete from tbl_nyuinryakusho where srycd = '190134010';
delete from tbl_nyuinryakusho where srycd = '190134110';
delete from tbl_nyuinryakusho where srycd = '190134310';
delete from tbl_nyuinryakusho where srycd = '190134410';
delete from tbl_nyuinryakusho where srycd = '190126010';
delete from tbl_nyuinryakusho where srycd = '190134510';
delete from tbl_nyuinryakusho where srycd = '190134610';
delete from tbl_nyuinryakusho where srycd = '190134710';
delete from tbl_nyuinryakusho where srycd = '190135110';
delete from tbl_nyuinryakusho where srycd = '190135210';
delete from tbl_nyuinryakusho where srycd = '190135310';
delete from tbl_nyuinryakusho where srycd = '190098870';
delete from tbl_nyuinryakusho where srycd = '190135710';
delete from tbl_nyuinryakusho where srycd = '190135810';
delete from tbl_nyuinryakusho where srycd = '190135910';
delete from tbl_nyuinryakusho where srycd = '190136010';
delete from tbl_nyuinryakusho where srycd = '190136310';
delete from tbl_nyuinryakusho where srycd = '190136410';
delete from tbl_nyuinryakusho where srycd = '190136510';
delete from tbl_nyuinryakusho where srycd = '190136610';
delete from tbl_nyuinryakusho where srycd = '190136710';
delete from tbl_nyuinryakusho where srycd = '190136810';
delete from tbl_nyuinryakusho where srycd = '190120510';
delete from tbl_nyuinryakusho where srycd = '190136910';
delete from tbl_nyuinryakusho where srycd = '190137070';
delete from tbl_nyuinryakusho where srycd = '190137110';
delete from tbl_nyuinryakusho where srycd = '190137210';
delete from tbl_nyuinryakusho where srycd = '190137310';
delete from tbl_nyuinryakusho where srycd = '190128210';
delete from tbl_nyuinryakusho where srycd = '190128310';
delete from tbl_nyuinryakusho where srycd = '190128410';
delete from tbl_nyuinryakusho where srycd = '190137410';
delete from tbl_nyuinryakusho where srycd = '190137510';
delete from tbl_nyuinryakusho where srycd = '190137610';
delete from tbl_nyuinryakusho where srycd = '190137710';
delete from tbl_nyuinryakusho where srycd = '190137810';
delete from tbl_nyuinryakusho where srycd = '190814010';
delete from tbl_nyuinryakusho where srycd = '190137910';
delete from tbl_nyuinryakusho where srycd = '190138010';
delete from tbl_nyuinryakusho where srycd = '190138110';
delete from tbl_nyuinryakusho where srycd = '190138210';
delete from tbl_nyuinryakusho where srycd = '190138310';
delete from tbl_nyuinryakusho where srycd = '190138410';
delete from tbl_nyuinryakusho where srycd = '190138510';
delete from tbl_nyuinryakusho where srycd = '190138610';
delete from tbl_nyuinryakusho where srycd = '190138710';
delete from tbl_nyuinryakusho where srycd = '190138810';
delete from tbl_nyuinryakusho where srycd = '190138910';
delete from tbl_nyuinryakusho where srycd = '190139010';
delete from tbl_nyuinryakusho where srycd = '190139110';
delete from tbl_nyuinryakusho where srycd = '190139210';
delete from tbl_nyuinryakusho where srycd = '190139310';
delete from tbl_nyuinryakusho where srycd = '190116310';
delete from tbl_nyuinryakusho where srycd = '190116410';
delete from tbl_nyuinryakusho where srycd = '190139810';
delete from tbl_nyuinryakusho where srycd = '190139910';
delete from tbl_nyuinryakusho where srycd = '190140010';
delete from tbl_nyuinryakusho where srycd = '190140110';
delete from tbl_nyuinryakusho where srycd = '190024710';
delete from tbl_nyuinryakusho where srycd = '190140410';
delete from tbl_nyuinryakusho where srycd = '190140510';
delete from tbl_nyuinryakusho where srycd = '190129310';
delete from tbl_nyuinryakusho where srycd = '190140710';
delete from tbl_nyuinryakusho where srycd = '190111110';
delete from tbl_nyuinryakusho where srycd = '190111210';
delete from tbl_nyuinryakusho where srycd = '190075810';
delete from tbl_nyuinryakusho where srycd = '190141610';
delete from tbl_nyuinryakusho where srycd = '190141710';
delete from tbl_nyuinryakusho where srycd = '190141810';
delete from tbl_nyuinryakusho where srycd = '190141910';

COPY "tbl_nyuinryakusho" FROM stdin;
190131310	20100401	99999999	°ìÆÃ£·				        	        	      
190131410	20100401	99999999	°ìÆÃ£±£°				        	        	      
190121310	20060701	20100331	ÎÅ£Á				        	        	      
190121310	20100401	99999999	ÎÅ£±£Á				        	        	      
190123710	20061001	20100331	ÎÅ£ÁÀ¸				        	        	      
190123710	20100401	99999999	ÎÅ£±£ÁÀ¸				        	        	      
190121410	20060701	20100331	ÎÅ£Â				        	        	      
190121410	20100401	99999999	ÎÅ£±£Â				        	        	      
190123810	20061001	20100331	ÎÅ£ÂÀ¸				        	        	      
190123810	20100401	99999999	ÎÅ£±£ÂÀ¸				        	        	      
190121510	20060701	20100331	ÎÅ£Ã				        	        	      
190121510	20100401	99999999	ÎÅ£±£Ã				        	        	      
190123910	20061001	20100331	ÎÅ£ÃÀ¸				        	        	      
190123910	20100401	99999999	ÎÅ£±£ÃÀ¸				        	        	      
190121610	20060701	20100331	ÎÅ£Ä				        	        	      
190121610	20100401	99999999	ÎÅ£±£Ä				        	        	      
190124010	20061001	20100331	ÎÅ£ÄÀ¸				        	        	      
190124010	20100401	99999999	ÎÅ£±£ÄÀ¸				        	        	      
190121710	20060701	20100331	ÎÅ£Å				        	        	      
190121710	20100401	99999999	ÎÅ£±£Å				        	        	      
190124110	20061001	20100331	ÎÅ£ÅÀ¸				        	        	      
190124110	20100401	99999999	ÎÅ£±£ÅÀ¸				        	        	      
190131610	20100401	99999999	ÎÅ£±£Æ				        	        	      
190131710	20100401	99999999	ÎÅ£±£ÆÀ¸				        	        	      
190131810	20100401	99999999	ÎÅ£±£Ç				        	        	      
190131910	20100401	99999999	ÎÅ£±£ÇÀ¸				        	        	      
190132010	20100401	99999999	ÎÅ£±£È				        	        	      
190132110	20100401	99999999	ÎÅ£±£ÈÀ¸				        	        	      
190132210	20100401	99999999	ÎÅ£±£É				        	        	      
190132310	20100401	99999999	ÎÅ£±£ÉÀ¸				        	        	      
190132410	20100401	99999999	ÎÅ£²£Á				        	        	      
190132510	20100401	99999999	ÎÅ£²£ÁÀ¸				        	        	      
190132610	20100401	99999999	ÎÅ£²£Â				        	        	      
190132710	20100401	99999999	ÎÅ£²£ÂÀ¸				        	        	      
190132810	20100401	99999999	ÎÅ£²£Ã				        	        	      
190132910	20100401	99999999	ÎÅ£²£ÃÀ¸				        	        	      
190133010	20100401	99999999	ÎÅ£²£Ä				        	        	      
190133110	20100401	99999999	ÎÅ£²£ÄÀ¸				        	        	      
190133210	20100401	99999999	ÎÅ£²£Å				        	        	      
190133310	20100401	99999999	ÎÅ£²£ÅÀ¸				        	        	      
190133410	20100401	99999999	ÎÅ£²£Æ				        	        	      
190133510	20100401	99999999	ÎÅ£²£ÆÀ¸				        	        	      
190133610	20100401	99999999	ÎÅ£²£Ç				        	        	      
190133710	20100401	99999999	ÎÅ£²£ÇÀ¸				        	        	      
190133810	20100401	99999999	ÎÅ£²£È				        	        	      
190133910	20100401	99999999	ÎÅ£²£ÈÀ¸				        	        	      
190134010	20100401	99999999	ÎÅ£²£É				        	        	      
190134110	20100401	99999999	ÎÅ£²£ÉÀ¸				        	        	      
190134310	20100401	99999999	·ëÆÃ£·				        	        	      
190134410	20100401	99999999	·ëÆÃ£±£°				        	        	      
190126010	20080401	99999999	·ëÆÃ				        	        	      
190134510	20100401	99999999	Àº£±£³				        	        	      
190134610	20100401	99999999	ÀºÆÃ£±£°				        	        	      
190134710	20100401	99999999	ÆÃÀº£±£³				        	        	      
190135110	20100401	99999999	¿Ç£³				        	        	      
190135210	20100401	99999999	¿Ç£³				        	        	      
190135310	20100401	99999999	¿Ç£³				        	        	      
190098870	00000000	20060331	°å´É				        	        	      
190098870	20060401	20100331	°å´É				        	        	      
190098870	20100401	99999999	ÁíÆşÂÎ				        	        	      
190135710	20100401	99999999	°å£±£µ				        	        	      
190135810	20100401	99999999	°å£²£°				        	        	      
190135910	20100401	99999999	µŞ´Ç£±				        	        	      
190136010	20100401	99999999	µŞ´Ç£²				        	        	      
190136310	20100401	99999999	¶¯¹Ô				        	        	      
190136410	20100401	99999999	½Å¥¢¥ë				        	        	      
190136510	20100401	99999999	½Å¥¢¥ë				        	        	      
190136610	20100401	99999999	Àİ¾ã				        	        	      
190136710	20100401	99999999	Àİ¾ã				        	        	      
190136810	20100401	99999999	±É¥µ				        	        	      
190120510	20060401	20100331	°ÂÁ´				        	        	      
190120510	20100401	99999999	°ÂÁ´£±				        	        	      
190136910	20100401	99999999	°ÂÁ´£²				        	        	      
190137070	20100401	99999999	´¶ËÉ				        	        	      
190137110	20100401	99999999	Âà·×£±				        	        	      
190137210	20100401	99999999	Âà²Ã£±				        	        	      
190137310	20100401	99999999	Âà²Ã£±				        	        	      
190128210	20080401	20100331	Âà·×				        	        	      
190128210	20100401	99999999	Âà·×£²				        	        	      
190128310	20080401	20100331	Âà²Ã				        	        	      
190128310	20100401	99999999	Âà²Ã£²				        	        	      
190128410	20080401	20100331	Âà²Ã				        	        	      
190128410	20100401	99999999	Âà²Ã£²				        	        	      
190137410	20100401	99999999	µŞÂà£±				        	        	      
190137510	20100401	99999999	µŞÂà£²				        	        	      
190137610	20100401	99999999	¿·Âà				        	        	      
190137710	20100401	99999999	µß¾Ò				        	        	      
190137810	20100401	99999999	µß¼õ				        	        	      
190814010	20080401	20100331	¸åÁí				        	        	      
190814010	20100401	99999999	ÁíÉ¾				        	        	      
190137910	20100401	99999999	¸Æ¥±¥¢				        	        	      
190138010	20100401	99999999	¸å»È				        	        	      
190138110	20100401	99999999	µßÌ¿£³				        	        	      
190138210	20100401	99999999	µßÌ¿£³				        	        	      
190138310	20100401	99999999	µßÌ¿£³				        	        	      
190138410	20100401	99999999	µßÌ¿£³Ç®				        	        	      
190138510	20100401	99999999	µßÌ¿£³Ç®				        	        	      
190138610	20100401	99999999	µßÌ¿£³Ç®				        	        	      
190138710	20100401	99999999	µßÌ¿£´				        	        	      
190138810	20100401	99999999	µßÌ¿£´				        	        	      
190138910	20100401	99999999	µßÌ¿£´				        	        	      
190139010	20100401	99999999	µßÌ¿£´Ç®				        	        	      
190139110	20100401	99999999	µßÌ¿£´Ç®				        	        	      
190139210	20100401	99999999	µßÌ¿£´Ç®				        	        	      
190139310	20100401	99999999	µßÌ¿£´Ç®				        	        	      
190116310	20060401	20100331	ÆÃ½¸				        	        	      
190116410	20060401	20100331	ÆÃ½¸				        	        	      
190116310	20100401	99999999	ÆÃ½¸£±				        	        	      
190116410	20100401	99999999	ÆÃ½¸£±				        	        	      
190139810	20100401	99999999	ÆÃ½¸£²				        	        	      
190139910	20100401	99999999	ÆÃ½¸£²				        	        	      
190140010	20100401	99999999	ÆÃ½¸£²Ç®				        	        	      
190140110	20100401	99999999	ÆÃ½¸£²Ç®				        	        	      
190024710	00000000	20100331	¿·½¸				        	        	      
190024710	20100401	99999999	¿·½¸£±				        	        	      
190140410	20100401	99999999	¿·½¸£²				        	        	      
190140510	20100401	99999999	¿·¼£²ó				        	        	      
190129310	20080401	99999999	¾®Æş´É£±				        	        	      
190140710	20100401	99999999	¾®Æş´É£²				        	        	      
190111110	20020401	20080331	¾®Æş´É£±				        	        	      
190111110	20080401	20100331	¾®Æş´É£²				        	        	      
190111110	20100401	99999999	¾®Æş´É£³				        	        	      
190111210	20020401	20080331	¾®Æş´É£²				        	        	      
190111210	20080401	20100331	¾®Æş´É£³				        	        	      
190111210	20100401	99999999	¾®Æş´É£´				        	        	      
190075810	00000000	20020331	¾®Æş´É				        	        	      
190075810	20020401	20080331	¾®Æş´É£³				        	        	      
190075810	20080401	20100331	¾®Æş´É£´				        	        	      
190075810	20100401	99999999	¾®Æş´É£µ				        	        	      
190141610	20100401	99999999	Éü¥êÆş£±				        	        	      
190141710	20100401	99999999	Éü¥êÆş£±À¸				        	        	      
190141810	20100401	99999999	Éü¥êÆş£²				        	        	      
190141910	20100401	99999999	Éü¥êÆş£²À¸				        	        	      
\.
